[
  {
    "url": "https://www.pnas.org/content/107/16/7503.long",
    "site": "PNAS",
    "favicon": {
      "url": "https://www.pnas.org/sites/default/files/images/favicon.ico",
      "safe": "https%3A%2F%2Fwww.pnas.org%2Fsites%2Fdefault%2Ffiles%2Fimages%2Ffavicon.ico"
    },
    "title": "Organismal, genetic, and transcriptional variation in the deeply sequenced gut microbiomes of identical twins",
    "description": "We deeply sampled the organismal, genetic, and transcriptional diversity in fecal samples collected from a monozygotic (MZ) twin pair and compared the results to 1,095 communities from the gut and other body habitats of related and unrelated individuals. Using a new scheme for noise reduction in pyrosequencing data, we estimated the total diversity of species-level bacterial phylotypes in the...",
    "article": "<div><p>Total community DNA and RNA was initially isolated from two fecal samples, each obtained from 26-year-old, obese, MZ female cotwins (body mass index, 39 and 45 kg/m2). Both cotwins (designated TS28 and TS29) had been vaginally delivered; neither cotwin had any history of intestinal disease, and neither had used antibiotics at least 6 months before providing fecal samples, at which time the cotwins lived 5 km apart (<a href=\"#ref-4\">4</a>). A 454 pyrosequencing method was used to obtain 1.2&#x2013;1.5 million sequencing reads from PCR-amplified V2 regions of bacterial 16S rRNA genes present in each fecal sample (average read length &#x223C;232 nt), and 3.8&#x2013;6.3 Gbp of single- and paired-end shotgun reads from total fecal community DNA (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Table S1</a>). Using a method for rRNA depletion based on a combination of size selection (to remove 5S rRNA and tRNA), and streptavidin bead-based pull-down of biotinylated oligonucleotides hybridized to domains conserved among gut bacterial rRNA genes (<a href=\"#ref-5\">5</a>), we enriched for fecal mRNA and then generated 12&#x2013;16 million sequencing reads representing expressed genes in their microbiomes (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Table S2</a>).</p><p>We analyzed test datasets composed of an unequal mixture of DNA from 90 cloned bacterial 16S rRNA gene sequences (<a href=\"#ref-2\">2</a>) or DNA purified from 67 bacterial strains cultured from the human gut and pooled together over a range of relative concentrations (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Table S3</a>). These test datasets were used to establish a set of procedures for removing noise from 16S rRNA datasets that arise from PCR and pyrosequencing (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\"><em>SI Text</em></a>).</p><p>Using these procedures, we determined that most species-level phylotypes were present at low abundance [species defined as organisms sharing &#x2265;97% sequence identity (%ID) in their 16S rRNA genes; <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Fig. S1</a>]; &#x223C;100,000 16S rRNA sequences were required to observe 60% of the total phylotypes (<a href=\"#F1\">Fig. 1<em>A</em></a>). At the 95%ID and 97%ID phylotype cutoffs, rarefaction curves did not completely saturate even when &gt;106 sequences were collected (<a href=\"#F1\">Fig. 1<em>A</em></a>), indicating that additional phylotypes remain uncharacterized even at this high level of coverage.</p><p>The total estimated diversity of species-level bacterial phylotypes (97%ID) in the TS28 and TS29 datasets was lower than expected (878 and 768, respectively; <a href=\"#T1\">Table 1</a> and <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Table S4</a>), based on previous studies that did not account for noise. There was notable variation even between these genetically identical cotwins: 35.9% and 49.1% of the species-level phylotypes found in the fecal communities of TS28 and TS29, respectively, were shared between the two samples (39.0% and 52.8% were shared at the 95%ID level).</p><p>However, these values do not account for phylotypes that may be abundant in one sample and rare in another. Overall, shared phylotypes showed a small but positive correlation in relative abundance between samples, and rarely varied by more than two orders of magnitude (<em>R</em>2 = 0.18 for 97%ID and <em>R</em>2 = 0.27 for 95%ID). This observation allowed us to define a normalized overlap between the samples by considering only phylotypes found at a sufficient relative abundance in each sample that they are unlikely to have been missed because of variations in their relative abundance (<em>&#x201C;Normalized overlap</em>&#x201D; in <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\"><em>SI Text</em></a>). With this normalization, 68% and 79% of 97%ID phylotypes in TS28 and TS29 were designated as being shared in the other cotwin&apos;s microbiota (76.7% and 86.0% at 95%ID).</p><p>To test whether the deep sampling of these cotwins allowed us to capture the bacterial diversity present in fecal samples obtained from other families containing twins, we extended our survey to include 1.1 million bacterial V2 16S rRNA sequencing reads from 281 fecal samples procured from 31 MZ and 23 dizygotic (DZ) twin pairs and their mothers [3,984 &#xB1; 232 (mean &#xB1; SEM) reads/sample] (<a href=\"#ref-4\">4</a>). Like the deeply sampled cotwins, these other twin pairs were born in Missouri, ranged in age from 25 to 32 years, did not have a history of GI pathology, and had not consumed antibiotics before sampling. All 16S rRNA pyrosequencing reads were preprocessed as done above to remove noise and chimeras.</p><p>A comparison of the total bacterial diversity found across these fecal samples and the two deeply sequenced samples underscored the much higher level of inter- compared with intrapersonal variation when considering a single body habitat (<a href=\"#F1\">Fig. 1<em>B</em></a>). The combined &#x201C;Shallow&#x201D; fecal datasets had an estimated 4,018 97%ID phylotypes and 2,498 95%ID phylotypes (2,815 and 1,974 observed, respectively). These values are &#x223C;5-fold higher than in each deeply sequenced fecal microbiota (<a href=\"#T1\">Table 1</a>). In addition, each sample had a unique collection of 97%ID phylotypes (mean &#xB1; SEM, 53.4 &#xB1; 0.6% and 50.3 &#xB1; 0.5% overlap with TS28 and TS29), whereas the fraction of phylotypes from each sample that were shared with TS28 correlated with the fraction shared with TS29 (<em>R</em>2 = 0.73; <a href=\"#F1\">Fig. 1<em>C</em></a>).</p><p>Our initial analysis of these fecal samples had indicated that there was no core set of abundant species-level phylotypes found in all individuals (<a href=\"#ref-4\">4</a>); this was confirmed after removing PCR and sequencing noise. The proportion of samples containing each phylotype was lower than expected by chance at all levels of relative abundance (<a href=\"#F1\">Fig. 1<em>D</em></a>), but within each level of abundance there was a large spread. Only a few phylotypes appeared in the majority of samples: of the 134 species-level phylotypes that had a relative abundance in the combined dataset &gt;0.1%, only 37 appeared in &gt;50% of the samples (28% of the phylotypes, compared with 100% expected by chance). Phylotypes assigned to the Firmicutes phylum were more evenly spread than the Bacteroidetes: 33% with &gt;0.1% relative abundance appeared in 50% of samples, compared with only 12% of the Bacteroidetes phylotypes (<a href=\"#F1\">Fig. 1<em>D</em></a>). In addition, one nearly ubiquitous phylotype belonging to the family Lachnospiraceae (phylum Firmicutes) was found in 99% of the samples, representing 5.7% of the sequences in the combined dataset.</p><p>To determine whether phylotypes present in the gut microbiota were detectable in other body habitats, we surveyed V2 16S rRNA sequencing reads obtained from nine unrelated healthy individuals (male and female) who had been sampled at 27 sites, including feces, twice over a 24-h period on two occasions, each occasion separated by 3 months (age range, 30&#x2013;35 years with the exception of one individual 60 years of age; no recent history of antibiotic use; mean &#xB1; SD 1,315 &#xB1; 420 reads per sample) (<a href=\"#ref-6\">6</a>). All data were subjected to the same denoising procedures described above.</p><p>A comparison of the total diversity found across the 27 body habitats to the shallowly sequenced fecal samples and the two deeply sequenced fecal samples demonstrated higher levels of diversity when comparing across multiple body habitats vs. comparisons of the same habitat across multiple individuals (<a href=\"#F1\">Fig. 1<em>B</em></a>). The combined 27-body habitats dataset contained an estimated 4,949 species-level phylotypes (97%ID) and 3,646 95%ID phylotypes (3,869 and 2,957 observed, respectively) (<a href=\"#T1\">Table 1</a>). Although the range of overlapping species-level phylotypes for the fecal samples from the 27-body habitat survey was comparable to the twin fecal cohort (mean&#xB1; SEM 45.1 &#xB1; 1.9% and 41.7 &#xB1; 1.4%), the other nongut body habitats showed a significantly reduced overlap (mean &#xB1; SEM 18.3 &#xB1; 0.3% and 15.3 &#xB1; 0.3% with TS28 and TS29; <em>P</em> &lt; 10&#x2212;17, Student&apos;s <em>t</em> test; <a href=\"#F1\">Fig. 1<em>C</em></a>). As with the fecal samples from the shallowly sampled twins, the fraction of phylotypes from each sample that were shared with TS28 correlates with the fraction shared with TS29 (<em>R</em>2 = 0.42).</p><p>Together, these results emphasize the following: (<em>i</em>) despite large interpersonal variations in the composition of the gut microbiota and the absence of a core set of abundantly represented universally shared phylotypes, common phylotypes can be identified through deep sequencing of a small number of individuals; (<em>ii</em>) a surprising amount of phylotypes are shared between distinct body habitats across unrelated individuals (i.e., only five samples did not contain any phylotypes from the deeply sequenced TS28 and TS29 gut microbial communities); and (<em>iii</em>) it seems feasible that future studies that broadly sample humans living in distinct cultural settings will be able to define population-wide gut phylotypes and, as a result, provide a rationale for selecting cultured representatives of these phylotypes for genome sequencing (e.g., start with phylotypes in the top right portion of <a href=\"#F1\">Fig. 1<em>D</em></a>).</p><p>We turned next to the following questions: Does deep sequencing enable the assembly and binning of &#x201C;population genomes&#x201D; from complex microbial communities? How diverse is the gut microbiome in terms of gene content. and how unique are these genes relative to those contained in 122 genomes from cultured human gut isolates? What can we infer about the similarities and differences between MZ cotwins when interrogating their deeply sequenced microbiomes?</p><p>Deep shotgun sequencing of total fecal community DNA allowed us to assemble and bin large scaffolds from the TS28 and TS29 microbiomes (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Tables S5</a> and <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">S6</a> and <em>Phylogenetic binning of microbiome scaffolds</em> in <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\"><em>SI Text</em></a>). A combined assembly of single- and paired-end pyrosequencing reads from TS28 and TS29 yielded 92,104 and 61,460 contigs &gt;500 bp per sample, with 11,780 and 6,392 scaffolds, respectively (scaffolds represent one or more contigs ordered and oriented using paired-end reads). PhyloPythia, a phylogenetic classifier that uses a multiclass Support Vector Machine (SVM) for composition-based characterization of sequence fragments at different taxonomic ranks (<a href=\"#ref-7\">7</a>), was trained on 1,775 finished or draft microbial genomes, in addition to 5,548 and 3,391 contigs from TS28 and TS29, respectively, that mapped with high confidence to gut microbial genomes (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Table S7</a>). After training, PhyloPythia was used to accurately bin all scaffolds &gt;2 Kbp at the genus- and family-level, resulting in 24&#x2013;25 bins of scaffolds per fecal sample; these bins contained from 2.0 Kbp to 22.4 Mbp of total sequence (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Figs. S2<em>B</em></a> and <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">S3</a> and <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Table S6</a>).</p><p>The total number of genes across all microbiome bins from the TS28 and TS29 fecal samples was 88,316 and 64,453, respectively. Clustering of protein sequences from these bins and the 122 gut microbial genomes, revealed 180,550, 257,823, and 334,211 total protein-coding gene clusters at 40%, 60%, and 80% identity cutoffs, respectively (<a href=\"#F2\">Fig. 2<em>A</em></a> and <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Fig. S2<em>A</em></a>). The largest group of gene clusters at all cutoffs was unique to the reference genomes, whereas 25% of the clusters were found only in the TS28 or TS29 microbiome bins. Overall, 36% of the gut microbiome gene clusters had a representative (60%ID) in the 122 gut microbial genome database, indicating that although sequencing reference genomes from culturable members of the microbiota has already uncovered a substantial proportion of the gene content present in the fecal communities of these cotwins, more reference genome and microbiome sequencing is clearly needed.</p><p>A total of 25 genus- and family-level bins were identified in the TS28 fecal microbiome dataset, and 24 in the TS29 dataset; 22 of these bins were found in both samples (bins unique to one sample only contained nine of the 16,554 total scaffolds). There were strong correlations between the two fecal microbiomes with respect to the number of scaffolds, their aggregate length, and the number of genes found in each bin (<em>R</em>2 = 0.94, 0.74, and 0.69, respectively; <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Table S6</a>). As expected from our bacterial 16S rRNA analyses, the genus-level bins with the largest number of scaffolds were the Ruminococcus, Bacteroides, Clostridium, and Eubacterium (members of the Bacteroidetes and Firmicutes phyla). However, substantial assemblies were also obtained from Methanobrevibacter [<em>M. smithii</em> is reported to be the dominant archaeon in the human gut microbiome; (<a href=\"#ref-8\">8</a>)] and from Bifidobacterium (the former is missed with primers for amplification of bacterial 16S rRNA genes, whereas the current version of V2-directed bacterial primers miss members of the latter taxa; <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Fig. S4</a>). When sequencing reads from each sample were mapped to the microbiome bins from that sample to identify high-confidence sequence variants in each bin, we found that the Faecalibacterium had the highest relative level of variation, whereas the Methanobrevibacter had the lowest (<a href=\"#F2\">Fig. 2<em>B</em></a>).</p><p>Taken together, these results suggest that &#x201C;population genomes&#x201D; can be constructed and reliably binned even from diverse microbial communities given enough sequencing depth, although rare members of the community will be missed (e.g., the TM7 phylum). The bins provided the basis for a more in-depth analysis, annotation, and transcriptional profiling than a standard gene-centric (i.e., sequencing read&#x2013;based) approach, revealing 36,151 and 24,134 gene clusters unique to TS28 and TS29, respectively, and not represented in any of the 122 reference gut genomes (<a href=\"#F2\">Fig. 2<em>A</em></a>). Comparisons of the abundance of shared clusters between TS28 and TS29 revealed a stronger average correlation than the shared species-level phylotypes (mean <em>R</em>2 = 0.37 vs. <em>R</em>2 = 0.18). Rarefaction analysis disclosed that the number of genes and gene clusters in the gut microbiomes continues to increase even after 2 million mapped reads (<a href=\"#F2\">Fig. 2<em>C</em></a>), with an estimated plateau of 242,023 and 234,661 genes, corresponding to 115,216 and 112,522 gene clusters in the TS28 and TS29 fecal microbiomes, respectively (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Table S8</a>).</p><p>The human genome lacks the large repertoire of glycoside hydrolases and polysaccharide lyases required to cleave the many glycosidic linkages present in complex dietary polysaccharides (<a href=\"#ref-9\">9</a>). Because processing of these polysaccharides is a major function of the distal gut microbiota (<a href=\"#ref-10\">10</a>), we annotated the predicted proteins from each genus- and family-level microbiome bin using procedures described in the Carbohydrate-Active EnZyme database [CAZy (<a href=\"#ref-9\">9</a>)] (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Table S9</a> and <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">S10</a> and <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Fig. S5</a>). In total, we observed 143 CAZy families representing 5,145 genes in the gut microbiomes of these cotwins.</p><p>In general, the relative abundance of genes assigned to each CAZy family was consistent across genus-level bins from both individuals (<a href=\"#F3\">Fig. 3<em>A</em></a> and <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Table S10</a>). However, one notable exception was found: the Faecalibacterium bin from TS28 contained 42 genes predicted to encode dockerins, which are small proteins involved in the assembly of extracellular cellulosomes (<a href=\"#ref-11\">11</a>). None of these genes were identified in the Faecalibacterium bin from her cotwin&apos;s fecal microbiome, nor in the genome of <em>F.prausnitzii</em> isolate M21/2. However, 30 dockerins were identified across the Ruminococcus and Eubacterium bins of the two samples (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Table S9</a>). In agreement with the predicted formation of cellulosomes, the Faecalibacterium dockerins from TS28 were found with a number of genes predicted to encode cellulases (GH5,GH9,GH44,GH48), beta-mannanases (GH26), xyloglucanases (GH74), and polysaccharide lyases (PL), none of which were observed in the Faecalibacterium bin from TS29 (&#x3C7;2 test, <em>P</em> &lt; 10&#x2212;4). Finally, a cohesin-encoding gene (the cognate molecule for dockerins) was identified in the Faecalibacterium bin from TS28, further supporting the existence of human gut cellulosomes.</p><p>To assess the distribution of genes predicted to encode dockerins across microbiomes from other twins, we compared 18 fecal microbiome datasets (mean &#xB1; SEM 535,232 &#xB1; 23,294 sequencing reads per sample; 118.7 &#xB1; 8.7 Mb/sample) obtained from six MZ twin-pairs and their mothers (<a href=\"#ref-4\">4</a>) to the protein-coding gene sequences from the microbiome bins obtained from the deeply sampled MZ twins. This analysis revealed that the identified dockerin-encoding genes are widely distributed across gut microbiomes but vary in abundance: all 18 microbiomes contained reads with significant sequence similarity to these genes (mean number of genes 12.4, range 1&#x2013;55 genes; and mean number of sequencing reads 54.3, range 2&#x2013;222 reads). However, only sequences from TS28 contained reads matching the identified cohesin-encoding gene.</p><p>Together, these results expand the known diversity of CAZymes in the human gut microbiome and reveal a suite of genes with predicted cellulolytic activity. The fact that the latter genes were highly enriched in the Faecalibacterium bins found in the microbiome of TS28 and not in her genetically identical cotwin highlights another level of genetic variation between humans. Future research will be necessary to characterize the enzymatic activity of these systems, the breadth of their organismal distribution, the host and environmental parameters (including diet) that determine their abundance in a given human gut microbiome, and their contributions to host nutrient/energy harvest.</p><p>To characterize gene expression in the gut microbiome, we analyzed cDNA and DNA datasets obtained from sequencing total community cDNA and DNA prepared from the two fecal samples of TS28 and TS29. All sequencing reads were mapped against the database of 122 gut microbial genomes and the microbiome bins (<em>Metatranscriptome analysis</em> in <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\"><em>SI Text</em></a>). The results revealed marked differences in gene abundance and expression (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Figs. S6</a> and <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">S7</a>). In all cases, technical replicates of each microbiome and metatranscriptome (<em>n</em> = 3&#x2013;4) clustered together; this clustering was robust to subsampling by COG functional categories (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Fig. S6</a>). Microbiome profiles showed the highest average correlation between individuals (<em>R</em>2 = 0.37), relative to metatranscriptomes (<em>R</em>2 = 0.12) and the relative abundance of species-level phylotypes (<em>R</em>2 = 0.18). As with the microbiome, rarefaction analysis of the metatranscriptome revealed that the number of expressed genes and gene clusters continues to increase even after 500,000 mapped reads (<a href=\"#F2\">Fig. 2<em>C</em></a>), with an estimated plateau of 85,099 and 173,309 genes, corresponding to 35,781 and 58,339 gene clusters in TS28 and TS29, respectively (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Table S8</a>).</p><p>We subsequently calculated the ratio of the relative abundance of cDNA sequences in each microbiome bin to the relative abundance of DNA sequences in that bin, for each fecal community (<a href=\"#ref-12\">12</a>). Even at the genus-level, there were detectable differences in relative gene expression: six bins showed higher relative expression than gene abundance, whereas the Bifidobacterium had the lowest level of relative expression in both microbiomes (<a href=\"#F2\">Fig. 2<em>D</em></a>).</p><p>We then compared cDNA and DNA profiles at the level of individual genes to determine the relative expression of each gene compared with its abundance (<a href=\"#ref-12\">12</a>). Genes were defined as &#x201C;High Relative Expression&#x201D; (High-Expr) or Low-Expr based on the ratio of cDNA to DNA relative abundance. A 10-fold difference was chosen as the threshold cutoff based on all pairwise comparisons of technical replicate datasets obtained from cDNA or DNA sequencing of each sample (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Fig. S8<em>A</em>,\n</a> <em>n</em> = 3&#x2013;4 replicates per sample per method).</p><p>These comparisons revealed 6,961 genes with high or low relative expression in the fecal microbiome of TS28 (4,816 High-Expr and 2,145 Low-Expr) and 7,893 genes in TS29 (5,476 High-Expr and 2,417 Low-Expr; <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Tables S11</a> and <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">S12</a>). As expected, many of these genes came from bins with an overall higher relative expression (<a href=\"#F2\">Fig. 2<em>D</em></a>), including Parabacteroides, Alistipes, Methanobrevibacter, and Bacteroides, or bins with a lower relative expression (the Bifidobacterium bin contained 962 Low-Expr genes in sample TS29 and 112 in TS28). However, some notable exceptions were found; the Bacteroides had 1,416 High-Expr genes in the TS28 microbiome, despite having overall similar levels of cDNA and DNA assignments across the entire bin (ratio 1.5).</p><p>The distribution of genes assigned to COG functional categories was then calculated using each set of High- or Low-Expr genes (<a href=\"#F3\">Fig. 3<em>B</em></a>), as well as the set of genes that were observed only with cDNA or DNA sequencing (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Fig. S9<em>A</em></a>). A disproportionate number of High-Expr genes encoded hypothetical proteins without predicted functions [33.9% (TS28) and 31.2% (TS29) of the High-Expr genes, comprising 77.9% (TS28) and 75.1% (TS29) of the total hypothetical genes with either a high or low relative expression]. High-Expr genes from both microbiomes were more frequently assigned to COG categories for translation (J), energy metabolism (C), and chaperones (O) (<a href=\"#F3\">Fig. 3<em>B</em></a> and <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Tables S11</a> and <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">S12</a>), whereas Low-Expr genes were more frequently assigned to COG categories for secretory systems (U), replication, recombination, and repair (L), and membrane proteins (M) (<a href=\"#F3\">Fig. 3<em>B</em></a>). In addition, many of these High-Expr genes have predicted functions related to fermentation and carbohydrate metabolism: e.g., ABC-type transport systems for carbohydrate import and metabolism plus genes involved in methanogenesis and acetogenesis (key pathways in the clearance of the hydrogen end-product of fermentation, and thus important determinants of fermentation efficiency).</p><p>To better characterize specific pathways represented by genes with high or low relative expression, we annotated each gene in the 122 gut microbial genomes and the microbiome bins using the KEGG annotation scheme (v52) (<a href=\"#ref-13\">13</a>). The relative abundance of KEGG pathways was tallied across genes defined as High- or Low-Expr in TS28 and TS29 or found to be unique to the cDNA or DNA datasets, and used for UPGMA clustering. Both microbiomes showed consistent trends, including high relative expression of genes assigned to pathways for essential cell processes, e.g., &#x201C;RNA polymerase,&#x201D; &#x201C;Ribosome,&#x201D; &#x201C;Pyruvate metabolism,&#x201D; and &#x201C;Glycolysis&#x201D; (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Fig. S8<em>B</em></a>). We extended these analyses to five additional samples from two sets of MZ cotwins and one unrelated individual (Samples labeled &#x201C;TSDA&#x201D; in <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Fig. S9</a> and <em>Additional microbiomes and meta-transcriptomes</em> in <a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\"><em>SI Text</em></a>) and found similar results, including the higher relative expression of genes assigned to COG categories for transcription, energy metabolism, defense mechanisms, and chaperones (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Fig. S9<em>A</em></a>), in addition to KEGG pathways involved in carbohydrate metabolism (e.g., fructose/mannose metabolism), nucleotide metabolism, and vitamin metabolism/biosynthesis (e.g., folate biosynthesis) (<a href=\"http://www.pnas.org/lookup/suppl/doi:10.1073/pnas.1002355107/-/DCSupplemental/stxt.pdf\">Fig. S9<em>B</em></a>).</p><p>Our results indicate that a majority of species-level phylotypes are shared between these deeply sampled MZ cotwins, despite large variations in the abundance of each phylotype. The genetic and transcriptional diversity of the human gut microbiome is remarkable. Much of this diversity has not been previously identified through sequencing cultured human gut isolates; 64% of the gene clusters present in our microbiome bins had no representative in a set of 122 human gut microbial genomes, and only 17% were shared between the two cotwins. This diversity, even between genetically identical individuals, provides an expanded view of our multicellularity and interpersonal genetic variation. Features of the genus-level bins within the gut microbiome were distinctive in many ways, ranging from differences in gene content and transcriptional activity, to the extent of sequence variation within each population. Identifying the factors that determine such between-taxon differences will provide an important step toward understanding the functions (niches) of these organisms in the human gut microbial community, with the ultimate goal of linking the presence of specific organisms to gene content and activity. Our results and the accompanying datasets also provide a framework for future studies of human and environmental microbiomes. As noted above, 16S rRNA gene sequence datasets can be used to prioritize genomes for isolation and sequencing, starting with the most abundant phylotypes found across the most individuals, and working toward the rare members of the gut microbiota. The reduced level of organismal diversity in a single individual implies that it may be soon be possible to identify all strains present in a single gut (fecal) microbiota. The fraction of shared phylotypes between MZ cotwins, between unrelated individuals, and between body habitats provides an important context for designing studies of the assembly, dynamic operations, and host effects of &#x201C;model&#x201D; human gut microbiota/microbiomes, composed of sequenced cultured gut isolates, in gnotobiotic mice. Finally, the application of transcriptional profiling to the study of human body habitat-associated microbial communities will enable correlations to be made between genes expressed by our microbiomes and our physiologic and metabolic phenotypes.</p></div>",
    "images": [
      {
        "url": "https://www.pnas.org/sites/default/files/highwire/pnas/107/16.cover.gif",
        "safe": "https%3A%2F%2Fwww.pnas.org%2Fsites%2Fdefault%2Ffiles%2Fhighwire%2Fpnas%2F107%2F16.cover.gif",
        "width": 134,
        "height": 178
      }
    ],
    "videos": [],
    "audios": [],
    "type": "rich",
    "duration": 3231,
    "html": "<div class=\"card\">\n    <a target=\"_blank\" href=\"https://www.pnas.org/content/107/16/7503.long\">\n      \n    <img onerror=\"this.style.display='none'\" class=\"card-image\" src=\"https://www.pnas.org/sites/default/files/highwire/pnas/107/16.cover.gif\">\n  \n      \n    <div class=\"card-text\">\n      <h3>Organismal, genetic, and transcriptional variation in the deeply sequenced gut microbiomes of identical twins</h3>\n      <p>We deeply sampled the organismal, genetic, and transcriptional diversity in fecal samples collected from a monozygotic (MZ) twin pair and compared the results to 1,095 communities from the gut and other body habitats of related and unrelated individuals. Using a new scheme for noise reduction in pyrosequencing data, we estimated the total diversity of species-level bacterial phylotypes in the...</p>\n      \n        <p class=\"fav\">\n          <img onerror=\"this.style.display='none'\" class=\"favicon\" src=\"https://www.pnas.org/sites/default/files/images/favicon.ico\">\n          PNAS\n        </p>\n    </div>\n  \n    </a>\n    </div>"
  },
  {
    "url": "https://genomebiology.biomedcentral.com/articles/10.1186/s13059-017-1319-7",
    "site": "Genome Biology",
    "favicon": {
      "url": "https://genomebiology.biomedcentral.com/static/images/favicons/bmc/favicon-96x96-6aff193bdb.png",
      "safe": "https%3A%2F%2Fgenomebiology.biomedcentral.com%2Fstatic%2Fimages%2Ffavicons%2Fbmc%2Ffavicon-96x96-6aff193bdb.png"
    },
    "title": "Alignment-free sequence comparison: benefits, applications, and tools",
    "description": "Alignment-free sequence analyses have been applied to problems ranging from whole-genome phylogeny to the classification of protein families, identification of horizontally transferred genes, and detection of recombined sequences. The strength of these methods makes them particularly useful for next-generation sequencing data processing and analysis. However, many researchers are unclear about...",
    "article": "<div></div>",
    "images": [
      {
        "url": "https://media.springernature.com/lw685/springer-static/image/art%3A10.1186%2Fs13059-017-1319-7/MediaObjects/13059_2017_1319_Fig1_HTML.gif",
        "safe": "https%3A%2F%2Fmedia.springernature.com%2Flw685%2Fspringer-static%2Fimage%2Fart%253A10.1186%252Fs13059-017-1319-7%2FMediaObjects%2F13059_2017_1319_Fig1_HTML.gif",
        "width": 685,
        "height": 563
      },
      {
        "url": "https://media.springernature.com/lw685/springer-static/image/art%3A10.1186%2Fs13059-017-1319-7/MediaObjects/13059_2017_1319_Fig2_HTML.gif",
        "safe": "https%3A%2F%2Fmedia.springernature.com%2Flw685%2Fspringer-static%2Fimage%2Fart%253A10.1186%252Fs13059-017-1319-7%2FMediaObjects%2F13059_2017_1319_Fig2_HTML.gif",
        "width": 685,
        "height": 404
      },
      {
        "url": "https://media.springernature.com/lw685/springer-static/image/art%3A10.1186%2Fs13059-017-1319-7/MediaObjects/13059_2017_1319_Fig3_HTML.gif",
        "safe": "https%3A%2F%2Fmedia.springernature.com%2Flw685%2Fspringer-static%2Fimage%2Fart%253A10.1186%252Fs13059-017-1319-7%2FMediaObjects%2F13059_2017_1319_Fig3_HTML.gif",
        "width": 685,
        "height": 517
      }
    ],
    "videos": [],
    "audios": [],
    "type": "rich",
    "duration": 559,
    "html": "<div class=\"card\">\n    <a target=\"_blank\" href=\"https://genomebiology.biomedcentral.com/articles/10.1186/s13059-017-1319-7\">\n      \n    <img onerror=\"this.style.display='none'\" class=\"card-image\" src=\"https://media.springernature.com/lw685/springer-static/image/art%3A10.1186%2Fs13059-017-1319-7/MediaObjects/13059_2017_1319_Fig1_HTML.gif\">\n  \n      \n    <div class=\"card-text\">\n      <h3>Alignment-free sequence comparison: benefits, applications, and tools</h3>\n      <p>Alignment-free sequence analyses have been applied to problems ranging from whole-genome phylogeny to the classification of protein families, identification of horizontally transferred genes, and detection of recombined sequences. The strength of these methods makes them particularly useful for next-generation sequencing data processing and analysis. However, many researchers are unclear about...</p>\n      \n        <p class=\"fav\">\n          <img onerror=\"this.style.display='none'\" class=\"favicon\" src=\"https://genomebiology.biomedcentral.com/static/images/favicons/bmc/favicon-96x96-6aff193bdb.png\">\n          Genome Biology\n        </p>\n    </div>\n  \n    </a>\n    </div>"
  },
  {
    "url": "https://almob.biomedcentral.com/articles/10.1186/s13015-017-0116-x",
    "site": "Algorithms for Molecular Biology",
    "favicon": {
      "url": "https://almob.biomedcentral.com/static/images/favicons/bmc/favicon-9ff1bf1161.ico",
      "safe": "https%3A%2F%2Falmob.biomedcentral.com%2Fstatic%2Fimages%2Ffavicons%2Fbmc%2Ffavicon-9ff1bf1161.ico"
    },
    "title": "HAlign-II: efficient ultra-large multiple sequence alignment and phylogenetic tree reconstruction with distributed and parallel computing",
    "description": "Multiple sequence alignment (MSA) plays a key role in biological sequence analyses, especially in phylogenetic tree construction. Extreme increase in next-generation sequencing results in shortage of efficient ultra-large biological sequence alignment approaches for coping with different sequence types. Distributed and parallel computing represents a crucial technique for accelerating ultra-large...",
    "article": "<div><p>The main research object of HAlign-II is ultra-large biological sequences dataset included protein sequences and nucleotide sequences. For protein sequences datasets, BAliBASE [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR28\">28</a>] is regarded as golden benchmark, with BAliBASE 4 as the newest version. The tests in the BAliBASE 4 benchmark suite are divided into 10 different reference sets. For each test, a number of files are provided, while all files derived from different families contain the sequences corresponding to the homologous regions only. And a family in a reference set is matched to a given reference alignment for evaluating. Each family need to be aligned simultaneously. In order to focus on the performance with increasing sequences scale, we employ the newest and largest R10 reference set &#x3A6;\n                    <i>Protein</i>\n                   as our protein sequence datasets (that is, 218 MSAs are independently constructed).</p><p>According to previous HAlign work [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR9\">9</a>], we use human mitochondrial genomes &#x3A6;\n                    <i>DNA</i>\n                   and 16s rRNA &#x3A6;\n                    <i>RNA</i>\n                   as nucleotide sequences datasets [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR29\">29</a>]. After MSA, phylogenetic trees are generated by MSA results on Spark platform. Table&#xA0;<a href=\"/articles/10.1186/s13015-017-0116-x#Tab1\">1</a> shows more detailed information regarding biological datasets.</p><p>The original bali score program in BAliBASE used a different way of handling gaps in segments, which resulted in incorrect normalizations, so that even perfect multiple alignments could have a score less than one. To determine the similarity of the alignment obtained by a program to the reference alignment in BAliBASE, column score (CS) and sum-of-pair score (SPS) are calculated as two alignment scores according to Karplus&#x2019;s work [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR30\">30</a>]. The CS counts the number of columns of the segments that are aligned correctly in all sequences, normalized by the number of alignment columns. It is noticeable however, that one badly misaligned sequence reduces CS from 1 to 0. Indeed we have observed that CS tends to be almost a binary value&#x2014;with each alignment either being very good or scoring 0. The SPS counts how many pairs of residues are correctly aligned. Suppose that there is an alignment with N sequences of length of M, if in column <i>i</i>, both sequence <i>x</i> and sequence <i>y</i> have residues aligned in a segment of the reference alignment, then pair value <i>P</i>\n                           \n                    <i>ixy</i>\n                   equals 2; if one of both alignments has a gap, then <i>P</i>\n                           \n                    <i>ixy</i>\n                   equals 1, otherwise <i>P</i>\n                           \n                    <i>ixy</i>\n                   equals 0. The total score is normalized by the maximum possible score, so that the range of possible values is from 0 to 1, with 1 indicating a multiple alignment that is identical on the segments. The score <i>S</i>\n                           \n                    <i>i</i>\n                   with the <i>i</i>th column and SPS are</p><p>where <i>M</i>\n                           \n                    <i>r</i>\n                   is the number of columns in the segments of the reference alignment and <i>S</i>\n                           \n                    <i>ri</i>\n                   is the score <i>S</i>\n                           \n                    <i>i</i>\n                   for the <i>i</i>th column in the reference alignment. For achieving better evaluation of ultra-large-scale alignments, we employ average SPS as the final metric of MSA experiments.</p><p>In essence, the higher the SPS or is, the more accurate is the alignments generated by the programs. In this paper, we calculated the alignment scores for evaluating protein and nucleotide alignments.</p><p>As HAlign-II contains three types of biological sequence alignment and phylogenetic tree construction based on Spark platform, our experimental environment consists of a cluster comprising 12 workstations. Each workstation features 384&#xA0;GB physical memory with Intel Xeon E5-2620 processors, and each processor contains eight processing cores. Based on Ubuntu 16.04 operating system and Spark 2.0.2, a series of experiments are presented in succeeding sections.</p><p>We select a series of state-of-the-art tools to compare with HAlign-II and evaluate its performance on addressing ultra-large datasets. Our comparison eliminates Kalign [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR31\">31</a>] is completely unsuitable for large-scale datasets. Similarly, phangorn [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR32\">32</a>], RAxML [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR33\">33</a>], Pasta [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR34\">34</a>], and STELLS [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR35\">35</a>] are eliminated because of their nearly intolerable time consumption. In particularly, Clustal Omega [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR36\">36</a>], designed for handling data-sets of hundreds of thousands of sequences in reasonable time, has no edge than other state-of-the-art tools in our large-scale datasets. As should be mentioned, SparkSW method uses Spark version 1.0; however, the newest version used in our cluster is 2.0, which performs better in theory. Additionally, we deploy the newest Hadoop framework on our cluster for running HAlign.</p><p>\n                           <i>Experiment (a)</i> Based on MUSCLE (version 3.8, fast parameter &#x201C;&#x2212;&#xA0;maxiters 2&#x201D; is used, the same below) [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR37\">37</a>], MAFFT (version 7.3, fast parameter &#x201C;&#x2212;&#xA0;parttree&#x201D; is used, the same below) [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR38\">38</a>], Clustal-Omega (version 1.2.4, default mode is used, the same below) [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR36\">36</a>], HAlign, and HAlign-II tools, we implement ultra-large multiple similar genome sequence alignments with &#x3A6;\n                    <i>DNA</i>\n                  (1&#xA0;&#xD7;), &#x3A6;\n                    <i>DNA</i>\n                  (100&#xA0;&#xD7;), and &#x3A6;\n                    <i>DNA</i>\n                  (1000&#xA0;&#xD7;) datasets.</p><p>\n                           <i>Experiment (b)</i> Based on MUSCLE, MAFFT, Clustal-Omega, HAlign, and HAlign-II tools, we implement ultra-large multiple dissimilarity RNA sequence alignments with &#x3A6;\n                    <i>RNA</i>\n                  (small) and &#x3A6;\n                    <i>RNA</i>\n                  (large) datasets.</p><p>\n                           <i>Experiment (c)</i> Based on MUSCLE, MAFFT, Clustal-Omega, SparkSW, and HAlign-II tools, we implement ultra-large multiple dissimilarity protein sequence alignments with &#x3A6;\n                    <i>Protein</i>\n                  (1&#xA0;&#xD7;), &#x3A6;\n                    <i>Protein</i>\n                  (100&#xA0;&#xD7;), and &#x3A6;\n                    <i>Protein</i>\n                  (1000&#xA0;&#xD7;) datasets. It is noticeable that MUSLE, MAFFT, SparkSW and HAlign-II align each family in the reference set, respectively.</p><p>\n                           <i>Experiment (d)</i> Based on IQ-TREE (version 1.5.5, multithread mode) [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR39\">39</a>], HPTree, and HAlign-II tools, we construct ultra-large phylogenetic trees with &#x3A6;\n                    <i>DNA</i>\n                  (1&#xA0;&#xD7;), &#x3A6;\n                    <i>DNA</i>\n                  (100&#xA0;&#xD7;), &#x3A6;\n                    <i>DNA</i>\n                  (1000&#xA0;&#xD7;), &#x3A6;\n                    <i>RNA</i>\n                  (small), &#x3A6;\n                    <i>RNA</i>\n                  (large), &#x3A6;\n                    <i>Protein</i>\n                  (1&#xA0;&#xD7;), &#x3A6;\n                    <i>Protein</i>\n                  (100&#xA0;&#xD7;), and &#x3A6;\n                    <i>Protein</i>\n                  (1000&#xA0;&#xD7;) datasets. For our HAlign-II method, we initially align multiple sequences and then build phylogenetic trees.</p><p>Tables&#xA0;<a href=\"/articles/10.1186/s13015-017-0116-x#Tab2\">2</a>, <a href=\"/articles/10.1186/s13015-017-0116-x#Tab3\">3</a>, and <a href=\"/articles/10.1186/s13015-017-0116-x#Tab4\">4</a> respectively show all experiment results with genome MSA, RNA MSA, and protein MSA. Surprisingly, MUSCLE exhibits extreme time consumption. Based on our experiments, MUSCLE performs best with small datasets, but it cannot properly allocate memory resource, resulting in high memory occupancy rate. Hence, MUSCLE eventually reports an out-of-memory message with ultra-large datasets. For large datasets, Mafft and Clustal-Omega are faster than default Muscle and fast Muscle. And Mafft is always the fastest one than Muscle and Clustal-Omega. However, MUSCLE, MAFFT and Clustal-Omega cannot deal with the present ultra-large datasets. Based on Hadoop framework, HAlign and HPTree perform better, but many key-value pair conversion operators also result in high memory occupancy rate. Considering the problems leading to degraded performance, HAlign-II utilizes memory operation on hard disks, cutting down space complexity and memory occupancy rate. These improvements facilitate running of sequence analysis on clusters comprising cheap large-scale and low-end machines. However, HAlign-II features an average SP score that is inferior to those of other methods. Our method ignores high precision for changing large-scale computing power, which is necessary for several decision research.</p><p>Table&#xA0;<a href=\"/articles/10.1186/s13015-017-0116-x#Tab5\">5</a> presents running times of several outstanding tools on phylogenetic trees construction. IQ-TREE with multiple threads consumes more time than HPTree and HAlign-II, as distributed computing on a single node utilizes multiple threads and features time-efficient data construction. Phylogenetic tree performance is evaluated by maximum likelihood value under log functions. HPTree point reaches &#x2013;&#xA0;219,543,85, which is similar to that of NJ model in MEGA [<a href=\"/articles/10.1186/s13015-017-0116-x#ref-CR40\">40</a>], implying close performance of results of both methods. Similarly, out-of-memory error occurs when running the HPTree method. Currently, no outstanding method exists for constructing large-scale evolutionary trees, even on workstation clusters. Constructing phylogenetic trees based on MSA results can speed up construction speed.</p><p>Currently, most time-efficient methods, such as MUSCLE with small datasets and Mafft/Clustal-Omega/HAlign for large-scale datasets, present extremely large space complexities, resulting in impossibility to actually address ultra-large datasets. Based on all experimental results of Tables&#xA0;<a href=\"/articles/10.1186/s13015-017-0116-x#Tab2\">2</a>, <a href=\"/articles/10.1186/s13015-017-0116-x#Tab3\">3</a>, <a href=\"/articles/10.1186/s13015-017-0116-x#Tab4\">4</a> and <a href=\"/articles/10.1186/s13015-017-0116-x#Tab5\">5</a>, we compare memory usage of HAlign-II with other state-of-the-art methods in Fig.&#xA0;<a href=\"/articles/10.1186/s13015-017-0116-x#Fig5\">5</a>.</p><p>Figure&#xA0;<a href=\"/articles/10.1186/s13015-017-0116-x#Fig5\">5</a> shows average maximum memory usage of each machine on the cluster containing 12 machines for SparkSW/HAlign/HAlign-II and a standalone machine for MUSCLE/Mafft/Clustal-Omega. To conclude, Spark framework exhibits more efficient memory than Hadoop framework, as shown by inferiority of HAlign compared with other methods. Whether for nucleotide sequences or protein sequences, HAlign-II presents the lowest average maximum memory usage, thereby facilitating ultra-large MSA and phylogenetic tree construction on cheaper clusters.</p><p>Additionally, Fig.&#xA0;<a href=\"/articles/10.1186/s13015-017-0116-x#Fig6\">6</a> shows that with increase in worker nodes, running time and memory efficiency becomes significantly low, indicating linear growth of capacity and computing power with increase of such nodes.</p></div>",
    "images": [
      {
        "url": "https://media.springernature.com/lw685/springer-static/image/art%3A10.1186%2Fs13015-017-0116-x/MediaObjects/13015_2017_116_Fig1_HTML.gif",
        "safe": "https%3A%2F%2Fmedia.springernature.com%2Flw685%2Fspringer-static%2Fimage%2Fart%253A10.1186%252Fs13015-017-0116-x%2FMediaObjects%2F13015_2017_116_Fig1_HTML.gif",
        "width": 359,
        "height": 224
      },
      {
        "url": "https://media.springernature.com/lw685/springer-static/image/art%3A10.1186%2Fs13015-017-0116-x/MediaObjects/13015_2017_116_Fig2_HTML.gif",
        "safe": "https%3A%2F%2Fmedia.springernature.com%2Flw685%2Fspringer-static%2Fimage%2Fart%253A10.1186%252Fs13015-017-0116-x%2FMediaObjects%2F13015_2017_116_Fig2_HTML.gif",
        "width": 359,
        "height": 419
      },
      {
        "url": "https://media.springernature.com/lw685/springer-static/image/art%3A10.1186%2Fs13015-017-0116-x/MediaObjects/13015_2017_116_Fig3_HTML.gif",
        "safe": "https%3A%2F%2Fmedia.springernature.com%2Flw685%2Fspringer-static%2Fimage%2Fart%253A10.1186%252Fs13015-017-0116-x%2FMediaObjects%2F13015_2017_116_Fig3_HTML.gif",
        "width": 685,
        "height": 288
      },
      {
        "url": "https://media.springernature.com/lw685/springer-static/image/art%3A10.1186%2Fs13015-017-0116-x/MediaObjects/13015_2017_116_Fig4_HTML.gif",
        "safe": "https%3A%2F%2Fmedia.springernature.com%2Flw685%2Fspringer-static%2Fimage%2Fart%253A10.1186%252Fs13015-017-0116-x%2FMediaObjects%2F13015_2017_116_Fig4_HTML.gif",
        "width": 359,
        "height": 241
      },
      {
        "url": "https://media.springernature.com/lw685/springer-static/image/art%3A10.1186%2Fs13015-017-0116-x/MediaObjects/13015_2017_116_Fig5_HTML.gif",
        "safe": "https%3A%2F%2Fmedia.springernature.com%2Flw685%2Fspringer-static%2Fimage%2Fart%253A10.1186%252Fs13015-017-0116-x%2FMediaObjects%2F13015_2017_116_Fig5_HTML.gif",
        "width": 685,
        "height": 351
      },
      {
        "url": "https://media.springernature.com/lw685/springer-static/image/art%3A10.1186%2Fs13015-017-0116-x/MediaObjects/13015_2017_116_Fig6_HTML.gif",
        "safe": "https%3A%2F%2Fmedia.springernature.com%2Flw685%2Fspringer-static%2Fimage%2Fart%253A10.1186%252Fs13015-017-0116-x%2FMediaObjects%2F13015_2017_116_Fig6_HTML.gif",
        "width": 638,
        "height": 371
      }
    ],
    "videos": [],
    "audios": [],
    "type": "rich",
    "duration": 460,
    "html": "<div class=\"card\">\n    <a target=\"_blank\" href=\"https://almob.biomedcentral.com/articles/10.1186/s13015-017-0116-x\">\n      \n    <img onerror=\"this.style.display='none'\" class=\"card-image\" src=\"https://media.springernature.com/lw685/springer-static/image/art%3A10.1186%2Fs13015-017-0116-x/MediaObjects/13015_2017_116_Fig1_HTML.gif\">\n  \n      \n    <div class=\"card-text\">\n      <h3>HAlign-II: efficient ultra-large multiple sequence alignment and phylogenetic tree reconstruction with distributed and parallel computing</h3>\n      <p>Multiple sequence alignment (MSA) plays a key role in biological sequence analyses, especially in phylogenetic tree construction. Extreme increase in next-generation sequencing results in shortage of efficient ultra-large biological sequence alignment approaches for coping with different sequence types. Distributed and parallel computing represents a crucial technique for accelerating ultra-large...</p>\n      \n        <p class=\"fav\">\n          <img onerror=\"this.style.display='none'\" class=\"favicon\" src=\"https://almob.biomedcentral.com/static/images/favicons/bmc/favicon-9ff1bf1161.ico\">\n          Algorithms for Molecular Biology\n        </p>\n    </div>\n  \n    </a>\n    </div>"
  },
  {
    "url": "https://www.biorxiv.org/content/10.1101/173203v4",
    "site": "bioRxiv",
    "favicon": {
      "url": "https://www.biorxiv.org/favicon.ico",
      "safe": "https%3A%2F%2Fwww.biorxiv.org%2Ffavicon.ico"
    },
    "title": "Abundance-based reconstitution of microbial pan-genomes from whole-metagenome shotgun sequencing data",
    "description": "Analysis toolkits for whole-metagenome shotgun sequencing data achieved strain-level characterization of complex microbial communities by capturing intra-species gene content variation. Yet, these tools are hampered by the extent of reference genomes that are far from covering all microbial variability, as many species are still not sequenced or have only few strains available.  Binning...",
    "article": "<div><div><p>Analysis toolkits for whole-metagenome shotgun sequencing data achieved strain-level characterization of complex microbial communities by capturing intra-species gene content variation. Yet, these tools are hampered by the extent of reference genomes that are far from covering all microbial variability, as many species are still not sequenced or have only few strains available.</p><p>Binning co-abundant genes obtained from de novo assembly is a powerful reference-free technique for discovering and reconstituting gene repertoire of microbial species. While current methods accurately identify species core genes, they miss many accessory genes or split them in small separated clusters.</p><p>We introduce MSPminer, a computationally efficient software tool that reconstitutes <span>M</span>etagenomic <span>S</span>pecies <span>P</span>an-genomes (MSPs) by binning co-abundant genes across large-scale metagenomic datasets. MSPminer relies on a new robust measure for grouping not only species core genes but accessory genes also. In MSPs, an empirical classifier distinguishes core from accessory and shared genes.</p><p>We applied MSPminer to the largest publicly available gene abundance table which is composed of 9.9M genes quantified in 1 267 stool samples. We show that MSPminer successfully reconstitutes in a matter of several hours gene repertoire of &gt; 1600 microbial species (some hitherto unknown) and detects many more accessory genes than existing tools. By compiling the information from thousands of samples, species gene content variability is better accounted for and their quantification is subsequently more precise</p></div></div>",
    "images": [
      {
        "url": "https://www.biorxiv.org/sites/default/files/images/biorxiv_logo_homepage7-5-small.png",
        "safe": "https%3A%2F%2Fwww.biorxiv.org%2Fsites%2Fdefault%2Ffiles%2Fimages%2Fbiorxiv_logo_homepage7-5-small.png",
        "width": 252,
        "height": 252
      }
    ],
    "videos": [],
    "audios": [],
    "type": "rich",
    "duration": 2587,
    "html": "<div class=\"card\">\n    <a target=\"_blank\" href=\"https://www.biorxiv.org/content/10.1101/173203v4\">\n      \n    <img onerror=\"this.style.display='none'\" class=\"card-image\" src=\"https://www.biorxiv.org/sites/default/files/images/biorxiv_logo_homepage7-5-small.png\">\n  \n      \n    <div class=\"card-text\">\n      <h3>Abundance-based reconstitution of microbial pan-genomes from whole-metagenome shotgun sequencing data</h3>\n      <p>Analysis toolkits for whole-metagenome shotgun sequencing data achieved strain-level characterization of complex microbial communities by capturing intra-species gene content variation. Yet, these tools are hampered by the extent of reference genomes that are far from covering all microbial variability, as many species are still not sequenced or have only few strains available.  Binning...</p>\n      \n        <p class=\"fav\">\n          <img onerror=\"this.style.display='none'\" class=\"favicon\" src=\"https://www.biorxiv.org/favicon.ico\">\n          bioRxiv\n        </p>\n    </div>\n  \n    </a>\n    </div>"
  },
  {
    "errorMessage": "Response contains a circular reference and cannot be serialized to JSON"
  },
  {
    "url": "https://www.nature.com/articles/s41588-018-0295-5",
    "site": "Nature Genetics",
    "favicon": {
      "url": "https://www.nature.com/static/images/favicons/nature/favicon.62367f778b.ico",
      "safe": "https%3A%2F%2Fwww.nature.com%2Fstatic%2Fimages%2Ffavicons%2Fnature%2Ffavicon.62367f778b.ico"
    },
    "title": "A primer on deep learning in genomics",
    "description": "This perspective presents a primer on deep learning applications for the genomics field. It includes a general guide for how to use deep learning and describes the current tools and resources that are available to the community.",
    "article": "<div><span>1.</span><p>Angermueller, C., P&#xE4;rnamaa, T., Parts, L. &amp; Stegle, O. Deep learning for computational biology. <i>Mol. Syst. Biol.</i> <b>12</b>, 878 (2016).</p><span>2.</span><p>Ching, T. et al. Opportunities and obstacles for deep learning in biology and medicine. <i>J. R. Soc. Interface</i> <b>15</b>, 20170387 (2018).</p><span>3.</span><p>Telenti, A., Lippert, C., Chang, P. C. &amp; DePristo, M. Deep learning of genomic variation and regulatory network data. <i>Hum. Mol. Genet.</i> <b>27</b>, R63&#x2013;R71 (2018).</p><span>4.</span><p>Yue, T. &amp; Wang, H. Deep learning for genomics: a concise overview. Preprint at <a href=\"https://arxiv.org/abs/1802.00810\">https://arxiv.org/abs/1802.00810</a> (2018).</p><span>5.</span><p>Camacho, D. M., Collins, K. M., Powers, R. K., Costello, J. C. &amp; Collins, J. J. Next-generation machine learning for biological networks. <i>Cell</i> <b>173</b>, 1581&#x2013;1592 (2018).</p><span>6.</span><p>Libbrecht, M. W. &amp; Noble, W. S. Machine learning applications in genetics and genomics. <i>Nat. Rev. Genet.</i> <b>16</b>, 321&#x2013;332 (2015).</p><span>8.</span><p>LeCun, Y., Bengio, Y. &amp; Hinton, G. Deep learning. <i>Nature</i> <b>521</b>, 436&#x2013;444 (2015).</p><span>9.</span><p>Krizhevsky, A., Sutskever, I. &amp; Hinton, G. E. Imagenet classification with deep convolutional neural networks. <i>Adv. Neural Inf. Process. Syst.</i> <b>1</b>, 1097&#x2013;1105 (2012).</p><span>10.</span><p>Hinton, G. E. &amp; Salakhutdinov, R. R. Reducing the dimensionality of data with neural networks. <i>Science</i> <b>313</b>, 504&#x2013;507 (2006).</p><span>11.</span><p>Srivastava, N., Hinton, G., Krizhevsky, A., Sutskever, I. &amp; Salakhutdinov, R. Dropout: a simple way to prevent neural networks from overfitting. <i>J. Mach. Learn. Res.</i> <b>15</b>, 1929&#x2013;1958 (2014).</p><span>12.</span><p>Khodabandelou, G., Mozziconacci, J. &amp; Routhier, E. Genome functional annotation using deep convolutional neural network. Preprint at <a href=\"https://www.biorxiv.org/content/early/2018/05/25/330308\">https://www.biorxiv.org/content/early/2018/05/25/330308</a> (2018).</p><span>13.</span><p>Zhou, J. &amp; Troyanskaya, O. G. Predicting effects of noncoding variants with deep learning-based sequence model. <i>Nat. Methods</i> <b>12</b>, 931&#x2013;934 (2015).</p><span>14.</span><p>Powers, D. M. W. Evaluation: from precision, recall and F-measure to ROC, informedness, markedness and correlation. <i>J. Mach. Learn. Technol.</i> <b>2</b>, 37&#x2013;63 (2011).</p><span>15.</span><p>Kelley, D. R., Snoek, J. &amp; Rinn, J. L. Basset: learning the regulatory code of the accessible genome with deep convolutional neural networks. <i>Genome Res.</i> <b>26</b>, 990&#x2013;999 (2016).</p><span>17.</span><p>Quang, D. &amp; Xie, X. DanQ: a hybrid convolutional and recurrent deep neural network for quantifying the function of DNA sequences. <i>Nucleic Acids Res.</i> <b>44</b>, e107 (2016).</p><span>18.</span><p>Sundararajan, M., Taly, A. &amp; Yan, Q. Axiomatic attribution for deep networks. Preprint at <a href=\"https://arxiv.org/abs/1703.01365v2\">https://arxiv.org/abs/1703.01365v2</a> (2017).</p><span>19.</span><p>Shrikumar, A., Greenside, P. &amp; Kundaje, A. Learning important features through propagating activation differences. <i>Proc. Int. Conf. Mach. Learn.</i> <b>70</b>, 3145&#x2013;3153 (2017).</p><span>20.</span><p>Ribeiro, M. T., Singh, S. &amp; Guestrin, C. &#x201C;Why should I trust you?&#x201D;: explaining the predictions of any classifier. in <i>KDD</i> 1135&#x2013;1144 (AAAI Press, Menlo Park, CA, USA, 2016).</p><span>22.</span><p>Alipanahi, B., Delong, A., Weirauch, M. T. &amp; Frey, B. J. Predicting the sequence specificities of DNA- and RNA-binding proteins by deep learning. <i>Nat. Biotechnol.</i> <b>33</b>, 831&#x2013;838 (2015).</p><span>23.</span><p>Lanchantin, J., Singh, R., Wang, B. &amp; Qi, Y. Deep motif dashboard: visualizing and understanding genomic sequences using deep neural networks. <i>Pac. Symp. Biocomput.</i> <b>22</b>, 254&#x2013;265 (2017).</p><span>24.</span><p>Zeng, H., Edwards, M. D., Liu, G. &amp; Gifford, D. K. Convolutional neural network architectures for predicting DNA-protein binding. <i>Bioinformatics</i> <b>32</b>, i121&#x2013;i127 (2016).</p><span>25.</span><p>Liu, F., Li, H., Ren, C., Bo, X. &amp; Shu, W. PEDLA: predicting enhancers with a deep learning-based algorithmic framework. <i>Sci. Rep.</i> <b>6</b>, 28517 (2016).</p><span>26.</span><p>Kleftogiannis, D., Kalnis, P. &amp; Bajic, V. B. DEEP: a general computational framework for predicting enhancers. <i>Nucleic Acids Res.</i> <b>43</b>, e6 (2015).</p><span>27.</span><p>Min, X. et al. Predicting enhancers with deep convolutional neural networks. <i>BMC Bioinformatics</i> <b>18</b> (Suppl. 13), 478 (2017).</p><span>28.</span><p>Eser, U. &amp; Stirling Churchman, L. FIDDLE: an integrative deep learning framework for functional genomic data inference. Preprint at <a href=\"https://www.biorxiv.org/content/early/2016/10/17/081380\">https://www.biorxiv.org/content/early/2016/10/17/081380</a> (2016).</p><span>29.</span><p>Li, Y., Shi, W. &amp; Wasserman, W. W. Genome-wide prediction of cis-regulatory regions using supervised deep learning methods. <i>BMC Bioinformatics</i> <b>19</b>, 202 (2018).</p><span>30.</span><p>Wang, Y. et al. Predicting DNA methylation state of CpG dinucleotide using genome topological features and deep networks. <i>Sci. Rep.</i> <b>6</b>, 19598 (2016).</p><span>31.</span><p>Schreiber, J., Libbrecht, M., Bilmes, J. &amp; Noble, W. Nucleotide sequence and DNaseI sensitivity are predictive of 3D chromatin architecture. Preprint at <a href=\"https://www.biorxiv.org/content/early/2017/01/30/103614\">https://www.biorxiv.org/content/early/2017/01/30/103614</a> (2017).</p><span>32.</span><p>Zeng, W., Wu, M. &amp; Jiang, R. Prediction of enhancer-promoter interactions via natural language processing. <i>BMC Genomics</i> <b>19</b> (Suppl. 2), 84 (2018).</p><span>33.</span><p>Shrikumar, A., Greenside, P. &amp; Kundaje, A. Reverse-complement parameter sharing improves deep learning models for genomics. Preprint at <a href=\"https://www.biorxiv.org/content/early/2017/01/27/103663\">https://www.biorxiv.org/content/early/2017/01/27/103663</a> (2017).</p><span>34.</span><p>Tan, J., Hammond, J. H., Hogan, D. A. &amp; Greene, C. S. ADAGE-based integration of publicly available <i>Pseudomonas aeruginosa</i> gene expression data with denoising autoencoders illuminates microbe-host interactions. <i>mSystems</i> <b>1</b>, e00025-15 (2016).</p><span>35.</span><p>Chen, Y., Li, Y., Narayan, R., Subramanian, A. &amp; Xie, X. Gene expression inference with deep learning. <i>Bioinformatics</i> <b>32</b>, 1832&#x2013;1839 (2016).</p><span>36.</span><p>Chen, L., Cai, C., Chen, V. &amp; Lu, X. Learning a hierarchical representation of the yeast transcriptomic machinery using an autoencoder model. <i>BMC Bioinformatics</i> <b>17</b> (Suppl. 1), 9 (2016).</p><span>37.</span><p>Cui, H. et al. Boosting gene expression clustering with system-wide biological information: a robust autoencoder approach. Preprint at <a href=\"https://www.biorxiv.org/content/early/2017/11/05/214122\">https://www.biorxiv.org/content/early/2017/11/05/214122</a> (2017).</p><span>38.</span><p>Xie, R., Wen, J., Quitadamo, A., Cheng, J. &amp; Shi, X. A deep auto-encoder model for gene expression prediction. <i>BMC Genomics</i> <b>18</b> (Suppl. 9), 845 (2017).</p><span>39.</span><p>Jha, A., Gazzara, M. R. &amp; Barash, Y. Integrative deep models for alternative splicing. <i>Bioinformatics</i> <b>33</b>, i274&#x2013;i282 (2017).</p><span>40.</span><p>Tripathi, R., Patel, S., Kumari, V., Chakraborty, P. &amp; Varadwaj, P. K. DeepLNC, a long non-coding RNA prediction tool using deep neural network. <i>Netw. Model. Anal. Health Inform. Bioinform.</i> <b>5</b>, 21 (2016).</p><span>41.</span><p>Yu, N., Yu, Z. &amp; Pan, Y. A deep learning method for lincRNA detection using auto-encoder algorithm. <i>BMC Bioinformatics</i> <b>18</b> (Suppl. 15), 511 (2017).</p><span>42.</span><p>Hill, S. T. et al. A deep recurrent neural network discovers complex biological rules to decipher RNA protein-coding potential. <i>Nucleic Acids Res.</i> <b>46</b>, 8105&#x2013;8113 (2018).</p><span>43.</span><p>Angermueller, C., Lee, H. J., Reik, W. &amp; Stegle, O. DeepCpG: accurate prediction of single-cell DNA methylation states using deep learning. <i>Genome Biol.</i> <b>18</b>, 67 (2017).</p><span>44.</span><p>Shaham, U. et al. Removal of batch effects using distribution-matching residual networks. <i>Bioinformatics</i> <b>33</b>, 2539&#x2013;2546 (2017).</p><span>45.</span><p>Lin, C., Jain, S., Kim, H. &amp; Bar-Joseph, Z. Using neural networks for reducing the dimensions of single-cell RNA-Seq data. <i>Nucleic Acids Res.</i> <b>45</b>, e156 (2017).</p><span>47.</span><p>Luo, R., Sedlazeck, F.J., Lam, T.-W. &amp; Schatz, M. Clairvoyante: a multi-task convolutional deep neural network for variant calling in single molecule sequencing. Preprint at <a href=\"https://www.biorxiv.org/content/early/2018/09/26/310458\">https://www.biorxiv.org/content/early/2018/09/26/310458</a> (2018).</p><span>48.</span><p>Luo, R., Lam, T.-W. &amp; Schatz, M. Skyhawk: an artificial neural network-based discriminator for reviewing clinically significant genomic variants. Preprint at <a href=\"https://www.biorxiv.org/content/early/2018/05/01/311985\">https://www.biorxiv.org/content/early/2018/05/01/311985</a> (2018).</p><span>50.</span><p>Bo&#x17E;a, V., Brejov&#xE1;, B. &amp; Vina&#x159;, T. DeepNano: deep recurrent neural networks for base calling in MinION nanopore reads. <i>PLoS One</i> <b>12</b>, e0178751 (2017).</p><span>51.</span><p>Teng, H., Hall, M.B., Duarte, T., Cao, M.D. &amp; Coin, L. Chiron: translating nanopore raw signal directly into nucleotide sequence using deep learning. Preprint at <a href=\"https://www.biorxiv.org/content/early/2017/08/23/179531\">https://www.biorxiv.org/content/early/2017/08/23/179531</a> (2017).</p><span>53.</span><p>Quang, D., Chen, Y. &amp; Xie, X. DANN: a deep learning approach for annotating the pathogenicity of genetic variants. <i>Bioinformatics</i> <b>31</b>, 761&#x2013;763 (2015).</p><span>54.</span><p>Korvigo, I., Afanasyev, A., Romashchenko, N. &amp; Skoblov, M. Generalising better: applying deep learning to integrate deleteriousness prediction scores for whole-exome SNV studies. <i>PLoS One</i> <b>13</b>, e0192829 (2018).</p><span>55.</span><p>Yuan, Y. et al. DeepGene: an advanced cancer type classifier based on deep learning and somatic point mutations. <i>BMC Bioinformatics</i> <b>17</b>, 476 (2016).</p><span>56.</span><p>Yousefi, S. et al. Predicting clinical outcomes from large scale cancer genomic profiles with deep survival models. <i>Sci. Rep.</i> <b>7</b>, 11707 (2017).</p><span>57.</span><p>Ma, W., Qiu, Z., Song, J., Cheng, Q. &amp; Ma, C. DeepGS: predicting phenotypes from genotypes using deep learning. Preprint at <a href=\"https://www.biorxiv.org/content/early/2017/12/31/241414\">https://www.biorxiv.org/content/early/2017/12/31/241414</a> (2017).</p><span>59.</span><p>Zhou, J. et al. Deep learning sequence-based ab initio prediction of variant effects on expression and disease risk. <i>Nat. Genet.</i> <b>50</b>, 1171&#x2013;1179 (2018).</p><span>60.</span><p>Sundaram, L. et al. Predicting the clinical impact of human mutation with deep neural networks. <i>Nat. Genet.</i> <b>50</b>, 1161&#x2013;1170 (2018).</p><span>63.</span><p>Ghorbani, A., Abid, A. &amp; Zou, J. Interpretation of neural networks is fragile. Preprint at <a href=\"https://arxiv.org/abs/1710.10547\">https://arxiv.org/abs/1710.10547</a> (2017).</p><span>64.</span><p>Gupta, A. &amp; Zou, J. Feedback GAN (FBGAN) for DNA: a novel feedback-loop architecture for optimizing protein functions. Preprint at <a href=\"https://arxiv.org/abs/1804.01694\">https://arxiv.org/abs/1804.01694</a> (2018).</p><span>65.</span><p>Stranger, B. et al.; eGTEx Project. Enhancing GTEx by bridging the gaps between genotype, gene expression, and disease. <i>Nat. Genet.</i> <b>49</b>, 1664&#x2013;1670 (2017).</p></div>",
    "images": [
      {
        "url": "https://media.springernature.com/full/springer-static/image/art%3A10.1038%2Fs41588-018-0295-5/MediaObjects/41588_2018_295_Fig1_HTML.png",
        "safe": "https%3A%2F%2Fmedia.springernature.com%2Ffull%2Fspringer-static%2Fimage%2Fart%253A10.1038%252Fs41588-018-0295-5%2FMediaObjects%2F41588_2018_295_Fig1_HTML.png",
        "width": 1513,
        "height": 584
      },
      {
        "url": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41588-018-0295-5/MediaObjects/41588_2018_295_Fig1_HTML.png",
        "safe": "https%3A%2F%2Fmedia.springernature.com%2Fm685%2Fspringer-static%2Fimage%2Fart%253A10.1038%252Fs41588-018-0295-5%2FMediaObjects%2F41588_2018_295_Fig1_HTML.png",
        "width": 685,
        "height": 264
      }
    ],
    "videos": [],
    "audios": [],
    "type": "rich",
    "duration": 452,
    "html": "<div class=\"card\">\n    <a target=\"_blank\" href=\"https://www.nature.com/articles/s41588-018-0295-5\">\n      \n    <img onerror=\"this.style.display='none'\" class=\"card-image\" src=\"https://media.springernature.com/full/springer-static/image/art%3A10.1038%2Fs41588-018-0295-5/MediaObjects/41588_2018_295_Fig1_HTML.png\">\n  \n      \n    <div class=\"card-text\">\n      <h3>A primer on deep learning in genomics</h3>\n      <p>This perspective presents a primer on deep learning applications for the genomics field. It includes a general guide for how to use deep learning and describes the current tools and resources that are available to the community.</p>\n      \n        <p class=\"fav\">\n          <img onerror=\"this.style.display='none'\" class=\"favicon\" src=\"https://www.nature.com/static/images/favicons/nature/favicon.62367f778b.ico\">\n          Nature Genetics\n        </p>\n    </div>\n  \n    </a>\n    </div>"
  },
  {
    "url": "https://www.nature.com/articles/s41592-018-0218-5",
    "site": "Nature Methods",
    "favicon": {
      "url": "https://www.nature.com/static/images/favicons/nature/favicon.62367f778b.ico",
      "safe": "https%3A%2F%2Fwww.nature.com%2Fstatic%2Fimages%2Ffavicons%2Fnature%2Ffavicon.62367f778b.ico"
    },
    "title": "Interpretation of an individual functional genomics experiment guided by massive public data",
    "description": "YETI puts individual -omics experiments in the context of public genomics data by creating an integrated dataset-specific functional network, thus allowing more thorough interpretation of the data.",
    "article": "<div><span>1.</span><p>Rung, J. &amp; Brazma, A. Reuse of public genome-wide gene expression data. <i>Nat. Rev. Genet.</i> <b>14</b>, 89&#x2013;99 (2013).</p><span>2.</span><p>Dolinski, K. &amp; Troyanskaya, O. G. Implications of Big Data for cell biology. <i>Mol. Biol. Cell</i> <b>26</b>, 2575&#x2013;2578 (2015).</p><span>3.</span><p>Eisen, M. B., Spellman, P. T., Brown, P. O. &amp; Botstein, D. Cluster analysis and display of genome-wide expression patterns. <i>Proc. Natl. Acad. Sci. USA</i> <b>95</b>, 14863&#x2013;14868 (1998).</p><span>4.</span><p>Stuart, J. M., Segal, E., Koller, D. &amp; Kim, S. K. A gene-coexpression network for global discovery of conserved genetic modules. <i>Science</i> <b>302</b>, 249&#x2013;255 (2003).</p><span>5.</span><p>De Smet, R. &amp; Marchal, K. Advantages and limitations of current network inference methods. <i>Nat. Rev. Microbiol.</i> <b>8</b>, 717&#x2013;729 (2010).</p><span>6.</span><p>Song, L., Langfelder, P. &amp; Horvath, S. Comparison of co-expression measures: mutual information, correlation, and model based indices. <i>BMC Bioinformatics</i> <b>13</b>, 328 (2012).</p><span>7.</span><p>Lee, H. K., Hsu, A. K., Sajdak, J., Qin, J. &amp; Pavlidis, P. Coexpression analysis of human genes across many microarray data sets. <i>Genome Res.</i> <b>14</b>, 1085&#x2013;1094 (2004).</p><span>8.</span><p>Wren, J. D. A global meta-analysis of microarray expression data to predict unknown gene functions and estimate the literature&#x2013;data divide. <i>Bioinformatics</i> <b>25</b>, 1694&#x2013;1701 (2009).</p><span>9.</span><p>Lee, I., Blom, U. M., Wang, P. I., Shim, J. E. &amp; Marcotte, E. M. Prioritizing candidate disease genes by network-based boosting of genome-wide association data. <i>Genome Res.</i> <b>21</b>, 1109&#x2013;1121 (2011).</p><span>10.</span><p>Huttenhower, C. et al. Exploring the human genome with functional maps. <i>Genome Res.</i> <b>19</b>, 1093&#x2013;1106 (2009).</p><span>11.</span><p>Park, C. Y. et al. Functional knowledge transfer for high-accuracy prediction of under-studied biological processes. <i>PLoS Comput. Biol.</i> <b>9</b>, e1002957 (2013).</p><span>12.</span><p>Gorenshteyn, D. et al. Interactive big data resource to elucidate human immune pathways and diseases. <i>Immunity</i> <b>43</b>, 605&#x2013;614 (2015).</p><span>13.</span><p>Greene, C. S. et al. Understanding multicellular function and disease with human tissue&#x2013;specific networks. <i>Nat. Genet.</i> <b>47</b>, 569&#x2013;576 (2015).</p><span>14.</span><p>Berger, B., Peng, J. &amp; Singh, M. Computational solutions for omics data. <i>Nat. Rev. Genet.</i> <b>14</b>, 333&#x2013;346 (2013).</p><span>15.</span><p>Cowen, L., Ideker, T., Raphael, B. J. &amp; Sharan, R. Network propagation: a universal amplifier of genetic associations. <i>Nat. Rev. Genet.</i> <b>18</b>, 551&#x2013;562 (2017).</p><span>16.</span><p>Grossman, R. L. et al. Toward a shared vision for cancer genomic data. <i>N. Engl. J. Med.</i> <b>375</b>, 1109&#x2013;1112 (2016).</p><span>17.</span><p>Clough, E. &amp; Barrett, T. The Gene Expression Omnibus Database. <i>Methods Mol. Biol.</i> <b>1418</b>, 93&#x2013;110 (2016).</p><span>18.</span><p>Hartmann, B. M. et al. Human dendritic cell response signatures distinguish 1918, pandemic, and seasonal H1N1 influenza viruses. <i>J. Virol.</i> <b>89</b>, 10190&#x2013;10205 (2015).</p><span>19.</span><p>Nogusa, S. et al. RIPK3 activates parallel pathways of MLKL-driven necroptosis and FADD-mediated apoptosis to protect against influenza A virus. <i>Cell Host Microbe</i> <b>20</b>, 13&#x2013;24 (2016).</p><span>20.</span><p>Hartmann, B. M. et al. Pandemic H1N1 influenza A viruses suppress immunogenic RIPK3-driven dendritic cell death. <i>Nat. Commun.</i> <b>8</b>, 1931 (2017).</p><span>21.</span><p>Bender, A. et al. The distinctive features of influenza virus infection of dendritic cells. <i>Immunobiology</i> <b>198</b>, 552&#x2013;567 (1998).</p><span>22.</span><p>Collado-Torres, L. et al. Reproducible RNA-seq analysis using Recount2. <i>Nat. Biotechnol.</i> <b>35</b>, 319&#x2013;321 (2017).</p><span>23.</span><p>Troyanskaya, O. et al. Missing value estimation methods for DNA microarrays. <i>Bioinformatics</i> <b>17</b>, 520&#x2013;525 (2001).</p><span>24.</span><p>Maglott, D., Ostell, J., Pruitt, K. D. &amp; Tatusova, T. Entrez Gene: gene-centered information at NCBI. <i>Nucleic Acids Res.</i> <b>39</b>, D52&#x2013;D57 (2011).</p><span>25.</span><p>Chatr-Aryamontri, A. et al. The BioGRID interaction database: 2013 update. <i>Nucleic Acids Res.</i> <b>41</b>, D816&#x2013;D823 (2013).</p><span>26.</span><p>Kerrien, S. et al. The IntAct molecular interaction database in 2012. <i>Nucleic Acids Res.</i> <b>40</b>, D841&#x2013;D846 (2012).</p><span>27.</span><p>Licata, L. et al. MINT, the molecular interaction database: 2012 update. <i>Nucleic Acids Res.</i> <b>40</b>, D857&#x2013;D861 (2012).</p><span>28.</span><p>Pagel, P. et al. The MIPS mammalian protein&#x2013;protein interaction database. <i>Bioinformatics</i> <b>21</b>, 832&#x2013;834 (2005).</p><span>29.</span><p>Portales-Casamar, E. et al. JASPAR 2010: the greatly expanded open-access database of transcription factor binding profiles. <i>Nucleic Acids Res.</i> <b>38</b>, D105&#x2013;D110 (2010).</p><span>30.</span><p>Grant, C. E., Bailey, T. L. &amp; Noble, W. S. FIMO: scanning for occurrences of a given motif. <i>Bioinformatics</i> <b>27</b>, 1017&#x2013;1018 (2011).</p><span>31.</span><p>Subramanian, A. et al. Gene set enrichment analysis: a knowledge-based approach for interpreting genome-wide expression profiles. <i>Proc. Natl. Acad. Sci. USA</i> <b>102</b>, 15545&#x2013;15550 (2005).</p><span>32.</span><p>Kotera, M., Hirakawa, M., Tokimatsu, T., Goto, S. &amp; Kanehisa, M. The KEGG databases and tools facilitating omics analysis: latest developments involving human diseases and pharmaceuticals. <i>Methods Mol. Biol.</i> <b>802</b>, 19&#x2013;39 (2012).</p><span>33.</span><p>Schaefer, C. F. et al. PID: the Pathway Interaction Database. <i>Nucleic Acids Res.</i> <b>37</b>, D674&#x2013;D679 (2009).</p><span>34.</span><p>Caspi, R. et al. The MetaCyc database of metabolic pathways and enzymes and the BioCyc collection of pathway/genome databases. <i>Nucleic Acids Res.</i> <b>40</b>, D742&#x2013;D753 (2012).</p><span>35.</span><p>Myers, C. L., Barrett, D. R., Hibbs, M. A., Huttenhower, C. &amp; Troyanskaya, O. G. Finding function: evaluation methods for functional genomic data. <i>BMC Genomics</i> <b>7</b>, 187 (2006).</p><span>36.</span><p>Myers, C. L. &amp; Troyanskaya, O. G. Context-sensitive data integration and prediction of biological networks. <i>Bioinformatics</i> <b>23</b>, 2322&#x2013;2330 (2007).</p><span>37.</span><p>Friedman, N., Geiger, D. &amp; Goldszmidt, M. Bayesian network classifiers. <i>Mach. Learn.</i> <b>29</b>, 131&#x2013;163 (1997).</p><span>38.</span><p>Steck, H. &amp; Jaakkola, T. S. On the Dirichlet prior and Bayesian regularization. In <i>Advances in Neural Information Processing Systems</i> (eds Becker, S., Thrun, S. &amp; Obermayer, K.) 713&#x2013;720 (MIT Press, Boston, MA, 2002).</p><span>39.</span><p>Huttenhower, C., Schroeder, M., Chikina, M. D. &amp; Troyanskaya, O. G. The Sleipnir library for computational functional genomics. <i>Bioinformatics</i> <b>24</b>, 1559&#x2013;1561 (2008).</p><span>40.</span><p>Brucker, P. An O(<i>n</i>) algorithm for quadratic knapsack problems. <i>Oper. Res. Lett.</i> <b>3</b>, 163&#x2013;166 (1984).</p><span>41.</span><p>Tibshirani, R. Regression shrinkage and selection via the Lasso. <i>J. R. Stat. Soc. B</i> <b>58</b>, 267&#x2013;288 (1996).</p><span>42.</span><p>Szekely, G. J. &amp; Rizzo, M. L. Brownian distance covariance. <i>Ann. Appl. Stat.</i> <b>3</b>, 1236&#x2013;1265 (2009).</p><span>43.</span><p>Simon, N. &amp; Tibshirani, R. Comment on &#x201C;Detecting novel associations in large data sets&#x201D; by Reshef Et Al, Science Dec 16, 2011. <i>arXiv</i> Preprint at <a href=\"https://arxiv.org/abs/1401.7645\">https://arxiv.org/abs/1401.7645</a> (2014).</p><span>44.</span><p>Lockhart, R., Taylor, J., Tibshirani, R. J. &amp; Tibshirani, R. A significance test for the Lasso. <i>Ann. Stat.</i> <b>42</b>, 413&#x2013;468 (2014).</p><span>45.</span><p>Efron, B., Hastie, T., Johnstone, I. &amp; Tibshirani, R. Least angle regression. <i>Ann. Stat.</i> <b>32</b>, 407&#x2013;451 (2004).</p><span>46.</span><p>Diestel, R. <i>Graph Theory</i> (Springer, Berlin/Heidelberg, 2018).</p><span>47.</span><p>Border&#xED;a, A. V., Hartmann, B. M., Fernandez-Sesma, A., Moran, T. M. &amp; Sealfon, S. C. Antiviral-activated dendritic cells: a paracrine-induced response state. <i>J. Immunol.</i> <b>181</b>, 6872&#x2013;6881 (2008).</p><span>48.</span><p>Ritchie, M. E. et al. limma powers differential expression analyses for RNA-sequencing and microarray studies. <i>Nucleic Acids Res.</i> <b>43</b>, e47 (2015).</p></div>",
    "images": [
      {
        "url": "https://media.springernature.com/full/springer-static/image/art%3A10.1038%2Fs41592-018-0218-5/MediaObjects/41592_2018_218_Fig1_HTML.png",
        "safe": "https%3A%2F%2Fmedia.springernature.com%2Ffull%2Fspringer-static%2Fimage%2Fart%253A10.1038%252Fs41592-018-0218-5%2FMediaObjects%2F41592_2018_218_Fig1_HTML.png",
        "width": 738,
        "height": 1338
      },
      {
        "url": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41592-018-0218-5/MediaObjects/41592_2018_218_Fig1_HTML.png",
        "safe": "https%3A%2F%2Fmedia.springernature.com%2Fm685%2Fspringer-static%2Fimage%2Fart%253A10.1038%252Fs41592-018-0218-5%2FMediaObjects%2F41592_2018_218_Fig1_HTML.png",
        "width": 377,
        "height": 685
      }
    ],
    "videos": [],
    "audios": [],
    "type": "rich",
    "duration": 356,
    "html": "<div class=\"card\">\n    <a target=\"_blank\" href=\"https://www.nature.com/articles/s41592-018-0218-5\">\n      \n    <img onerror=\"this.style.display='none'\" class=\"card-image\" src=\"https://media.springernature.com/full/springer-static/image/art%3A10.1038%2Fs41592-018-0218-5/MediaObjects/41592_2018_218_Fig1_HTML.png\">\n  \n      \n    <div class=\"card-text\">\n      <h3>Interpretation of an individual functional genomics experiment guided by massive public data</h3>\n      <p>YETI puts individual -omics experiments in the context of public genomics data by creating an integrated dataset-specific functional network, thus allowing more thorough interpretation of the data.</p>\n      \n        <p class=\"fav\">\n          <img onerror=\"this.style.display='none'\" class=\"favicon\" src=\"https://www.nature.com/static/images/favicons/nature/favicon.62367f778b.ico\">\n          Nature Methods\n        </p>\n    </div>\n  \n    </a>\n    </div>"
  },
  {
    "url": "https://genomebiology.biomedcentral.com/articles/10.1186/s13059-018-1592-0",
    "site": "Genome Biology",
    "favicon": {
      "url": "https://genomebiology.biomedcentral.com/static/images/favicons/bmc/favicon-194x194-501ed5e5ea.png",
      "safe": "https%3A%2F%2Fgenomebiology.biomedcentral.com%2Fstatic%2Fimages%2Ffavicons%2Fbmc%2Ffavicon-194x194-501ed5e5ea.png"
    },
    "title": "A new look at an old question: when did the second whole genome duplication occur in vertebrate evolution?",
    "description": "A recent study used 61 extant animal genomes to reconstruct the chromosomes of the hypothetical amniote ancestor. Comparison of this karyotype to the 17 chordate linkage groups previously inferred in the ancestral chordate indicated that two whole genome duplications probably occurred in the lineage preceding the ancestral vertebrate.",
    "article": "<div><p>To bridge the large evolutionary distance between extant vertebrates and the ancestral chordate with an unduplicated genome, Sacerdot and colleagues first reconstructed the ancestral amniote genome. To do so, they first applied the AGORA algorithm (Algorithm for Gene order Reconstruction in Ancestors) that they had previously developed [<a href=\"/articles/10.1186/s13059-018-1592-0#ref-CR6\">6</a>] to the gene orders, orientations and gene trees of 61 genomes of extant animals from the Ensembl database. These included 40 mammals, 3 birds, 2 reptiles, 1 amphibian, 8 teleosts, 1 coelacanth, 2 tunicates, 1 nematode and 1 fly. Unfortunately, Ensembl does not include the genome of any cartilaginous fish (e.g. the elephant shark, <i>Callorhinchus milii</i>, a chimaera, which has the slowest-evolving vertebrate genome known), or those of hemichordates, echinoderms or cephalochordates &#x2013; invertebrate deuterostomes whose genomes have not undergone the considerable gene loss and compaction characteristic of tunicate genomes.</p><p>Sacerdot et al. then identified putative ohnolog gene pairs in this ancestral amniote genome and produced sets of Contiguous Ancestral Regions (CARs). Ohnologs are homologous genes within a species resulting from WGDs. Finally, they grouped these CARs into a set of 51 that significantly fell into 17 groups of four, or tetrads; the expected outcome of two rounds of WGD. To distinguish the pattern of chromosomal fusions and fissions during evolution, they wanted to compare these 17 tetrads to the organization of genes in an unduplicated pre-vertebrate genome. However, tunicate genomes are evolving very rapidly and are quite divergent from those of other invertebrate deuterostomes, while the published genome assembly of the cephalochordate <i>Branchiostoma floridae</i> is overly fragmented for the analysis. Therefore, the authors compared their 17 tetrads of CARs to the 17 ancestral chordate linkage groups previously determined by comparison of the synteny of genes on human chromosomes and on scaffolds of the <i>B. floridae</i> genome. Remarkably, each of these chordate linkage groups correlated with one predominant CAR tetrad. They concluded from this comparison that the genome of the ancestral vertebrate had 17 chromosomes that then duplicated into 34 chromosomes through one round of WGD (1R). Subsequently, there were 7 chromosome fusions resulting in 27 chromosomes, which at the origin of the vertebrates, before the agnathan/gnathosome split, duplicated again (2R WGD) into 54 chromosomes. After the 2R WGD, there were four additional fusions before the ancestral bony vertebrate followed by a fifth fusion before the base of the amniotes. Thus, the ancestral karyotype of bony vertebrates included 50 chromosomes and the ancestral amniote had 49 chromosomes (Fig. <a href=\"/articles/10.1186/s13059-018-1592-0#Fig1\">1</a>b).</p><p>In addition to reconstructing duplications, fusions and fissions of chromosomes during evolution, the AGORA algorithm can calculate the gene orders on the chromosomes of the hypothetical amniote ancestor by comparing the gene orders on the chromosomes of its extant descendants [<a href=\"/articles/10.1186/s13059-018-1592-0#ref-CR6\">6</a>]. This reconstructed ancestral amniote genome contains 80% of the 15,854 genes in the CARs. The uneven distribution of these genes on the 49 chromosomes of the ancestral amniote could reflect reality or alternatively the difficulty of reconstructing the gene order on chromosomes that had undergone considerable gene rearrangement during evolution.</p><p>Even so, two things stand out in the analysis. The first is that comparison of the ancestral amniote genome with the CARs grouped into 17 tetrads to the super-scaffolds of the lamprey (<i>Petromyzon marinus</i>) genome assembly shows a clear 1-to-four pattern consistent with 2R WGD <i>before</i> the agnathan/gnathostome split. This is at odds with the results of Smith et al. [<a href=\"/articles/10.1186/s13059-018-1592-0#ref-CR3\">3</a>, <a href=\"/articles/10.1186/s13059-018-1592-0#ref-CR4\">4</a>] who found strong evidence for only 1R WGD in the lamprey when compared to the chicken. This discrepancy could be explained by the inclusion of genomic data from more species in reconstructing the hypothetical ancestral amniote genome, a process that in itself also eliminates confounding genome rearrangements that have occurred in vertebrates subsequent to the amniote ancestor. It is likely also due to the inclusion of phylogenetic data to determine the CAR tetrads, thus revealing ohnologs that diverged at the base of vertebrate evolution.</p><p>The second result that stands out is the correspondence between gene order on human chromosomes and the 17 pre-1R chromosomes. When the 17 pre-1R chromosomes are color coded (Fig. <a href=\"/articles/10.1186/s13059-018-1592-0#Fig1\">1</a>b) and the colors of each gene transferred to the positions of the 8282 human genes that descended from the pre-1R genes, the pattern of genome duplications and translocations is apparent. For example, chromosome 1 in the pre-1R genome contains <i>Hox</i> genes. A large segment of human chromosome 2 contains the <i>HoxD</i> cluster plus many other genes corresponding to those on pre-1R chromosome 1. The other 3 human <i>Hox</i> clusters are located on human chromosomes 7, 12 and 17. In addition, asubstantial numbers of homologs of other genes on pre-1R chromosome 1 are located on human chromosomes 1, 3, 10, 16 and 22, indicative of translocations.</p></div>",
    "images": [
      {
        "url": "https://media.springernature.com/lw685/springer-static/image/art%3A10.1186%2Fs13059-018-1592-0/MediaObjects/13059_2018_1592_Fig1_HTML.png",
        "safe": "https%3A%2F%2Fmedia.springernature.com%2Flw685%2Fspringer-static%2Fimage%2Fart%253A10.1186%252Fs13059-018-1592-0%2FMediaObjects%2F13059_2018_1592_Fig1_HTML.png",
        "width": 685,
        "height": 684
      }
    ],
    "videos": [],
    "audios": [],
    "type": "rich",
    "duration": 315,
    "html": "<div class=\"card\">\n    <a target=\"_blank\" href=\"https://genomebiology.biomedcentral.com/articles/10.1186/s13059-018-1592-0\">\n      \n    <img onerror=\"this.style.display='none'\" class=\"card-image\" src=\"https://media.springernature.com/lw685/springer-static/image/art%3A10.1186%2Fs13059-018-1592-0/MediaObjects/13059_2018_1592_Fig1_HTML.png\">\n  \n      \n    <div class=\"card-text\">\n      <h3>A new look at an old question: when did the second whole genome duplication occur in vertebrate evolution?</h3>\n      <p>A recent study used 61 extant animal genomes to reconstruct the chromosomes of the hypothetical amniote ancestor. Comparison of this karyotype to the 17 chordate linkage groups previously inferred in the ancestral chordate indicated that two whole genome duplications probably occurred in the lineage preceding the ancestral vertebrate.</p>\n      \n        <p class=\"fav\">\n          <img onerror=\"this.style.display='none'\" class=\"favicon\" src=\"https://genomebiology.biomedcentral.com/static/images/favicons/bmc/favicon-194x194-501ed5e5ea.png\">\n          Genome Biology\n        </p>\n    </div>\n  \n    </a>\n    </div>"
  },
  {
    "url": "https://academic.oup.com/bioinformatics/article/34/22/3801/5089231?searchresult=1",
    "site": "OUP Academic",
    "favicon": {
      "url": "https://oup.silverchair-cdn.com/UI/app/img/v-637087210721125680/favicon-16x16.png",
      "safe": "https%3A%2F%2Foup.silverchair-cdn.com%2FUI%2Fapp%2Fimg%2Fv-637087210721125680%2Ffavicon-16x16.png"
    },
    "title": "Bayesian integrative model for multi-omics data with missingness",
    "description": "AbstractMotivation.  Integrative analysis of multi-omics data from different high-throughput experimental platforms provides valuable insight into regulatory me",
    "article": "<div><p>Multi-level omics data refer to the combined molecular data in various types, for example, genome, transcriptome, methylome and proteome data, measured on a common cohort of patients. The availability of multi-level omics data in both magnitude and varieties poses challenges as well as opportunities to understand fundamental mechanisms of diseases and pathologies. Compared with separately discovering the association patterns between each omics data and phenotypes, an integrative framework that simultaneously integrates multiple omics data types will uncover more insightful regulatory machineries between different omics data and will hence deepen our understanding to hereditary and environmental causes in pathology (<a>Richardson <em>et al.</em>, 2016</a>; <a>Tseng <em>et al.</em>, 2012</a>, <a>2015</a>).</p><p>In the literature, many strategies have emerged for integration of multi-omics data. To cluster samples for identifying unknown disease subtypes, integrative clustering (iCluster; <a>Shen <em>et al.</em>, 2009</a>), Bayesian consensus clustering (<a>Lock and Dunson, 2013</a>), group structured integrative clustering (GS-iCluster; <a>Kim <em>et al.</em>, 2017</a>) and integrative sparse K-means (IS-Kmeans; <a>Huo <em>et al.</em>, 2017</a>) have been developed for integrative clustering of multi-omics data. For association and prediction modelling, Integrative Bayesian Analysis of Genomics (iBAG) (<a>Wang <em>et al.</em>, 2013</a>) investigates association patterns of mRNA expressions and methylation with clinical outcome via a mechanistic model for associating methylation with gene expression and then a clinical model for direct association between expression and clinical outcome or via methylation. A Bayesian hierarchical model is then established for the inference. Such Bayesian hierarchical modelling has gained popularity in multi-omics integrative analysis due to its flexibility in model construction for complex regulatory structure, convenience to incorporate prior biological knowledge and advances in modern computing. In the association and prediction modelling, we usually focus on two key goals in the inference: firstly, to select predictive biomarkers for the phenotype and secondly, to predict clinical outcome from the selected biomarkers. As tens of thousands of features are available in omics data, the first goal of feature selection is essential in interrogating the biological and pathological mechanism of a targeted disease. The second goal could be of immediate clinical use, for example, assisting diagnosis of a disease, directing the best treatment decision and predicting drug response.</p><p>One obstacle for applying multi-omics integrative methods in real applications is missing data. Due to various reasons (e.g. limited budget, bad tissue quality or insufficient tissue amount), it is common that only partial samples have all omics data types (<a>Voillet <em>et al.</em>, 2016</a>). For example, TCGA breast cancer study had 922 samples measured in methylation array, yet only 781 were measured in miRNA expression and 587 were measured for gene expression. Almost 40% of the samples are missing at least one type of omics data. To circumvent this pitfall, a na&#xEF;ve and convenient solution is by complete case (CC) analysis, where samples with any missing measurement are ignored. This approach results in dramatic decrease of sample size and thus decreases of statistical power, especially when more omics data types are combined. The shortcoming of CC in omics studies is recently noticed by statisticians, for example, <a>Voillet <em>et al.</em> (2016)</a> who developed a multiple imputation approach focusing on multiple factor analysis for multiple omics data. However, a unified framework serving the aforementioned purpose of feature selection, prediction as well as missingness handling is still lacking. In Bayesian methods for analysis of data with some predictors that are missing at random, marginal distribution of those predictors are usually modelled (<a>Ibrahim <em>et al.</em>, 2002</a>; Little and Rubin, 2002). The data augmentation method is used to obtain the posterior distribution of parameters of interest (<a>Tanner and Wong, 1987</a>). In each iteration of the data augmentation procedure, missing values are imputed from the conditional distribution of those covariates given observed data under current parameters and model parameters are subsequently drawn from their posterior distribution calculated from the imputed dataset. In this article, we are motivated by the iBAG model combining mRNA expression methylation, clinical variables to predict a targeted continuous outcome. We propose a <em>full Bayesian model with missingness (FBM)</em> that allows iBAG to handle situations when partial samples are missing with mRNA expression or methylation. Extensive simulations and real applications demonstrated superior performance in feature selection and prediction accuracy of the new approach compared with na&#xEF;ve CC approach. The model can be extended to other omics data types or other targeted outcomes (e.g. binary or survival).</p><p>The article is structured as the following. In Section 2.1, we introduce the motivation, the original iBAG model and the proposed FBM. Section 2.2 discusses the inference of prediction and feature selection of FBM (Section 2.2.1) and evaluation benchmarks (Section 2.2.2). Section 3 contains extensive simulations to evaluate performance of FBM and Section 4 proposes a <em>cross-validation (CV) decision scheme</em> to determine whether and how to incorporate samples with missingness in FBM. Section 5 includes an application to a childhood asthma dataset with 460 individuals. Final conclusion and discussion are presented in Section 6.</p><p>IBAG is a two-layer Bayesian hierarchical model for vertical integrative analysis of multi-level omics data, assuming data are complete. However, in reality, a large proportion of missing data is commonly seen due to budget or limitation in tissue collection. <a>Figure&#xA0;1a</a> gives an example of data structure with missingness. Suppose there are a total of <em>N</em> samples, <span>Y</span> indicates the clinical outcome of interest; <em>C</em> indicates clinical factors; <span>GN&#xD7;K=(G&#x2032;obs,NobsG&#xD7;K,G&#x2032;mis,NmisG&#xD7;K)&#x2032;</span> indicates the gene expression with missingness, where <span>UG=(U1G,&#x2026;UNG)</span> is the missing indicator; likewise, <span>MN&#xD7;J=(M&#x2032;obs,NobsM&#xD7;J,M&#x2032;mis,NmisM&#xD7;J)&#x2032;</span> indicates methylation data with missingness, where <span>UM=(U1M,&#x2026;UNM)</span> is the missing indicator. <em>U&#x2009;</em>=<em>&#x2009;</em>1 indicates missing and <em>U&#x2009;</em>=<em>&#x2009;</em>0 indicates observed. For example, number of samples with methylation level missing is <span>NobsG=N&#x2212;&#x2211;k=1KUkG&#x2060;</span>. We assume <span>UiM&#xD7;UiG&#x2260;1</span> for <span>&#x2200;&#x2009;1&#x2264;i&#x2264;N&#x2060;</span>. The original iBag model takes only the complete data and is subject to loss of statistical power. To handle missingness, we propose a full Bayesian model with missingness inspired by iBAG model, to achieve three goals simultaneously: feature selection, prediction and missing data imputation. In Section 2.1.2, we briefly introduce the iBAG model. In Section 2.1.3, we propose our full Bayesian model for multi-omics integration with missingness imputation. </p><p><a>Figure&#xA0;1b</a> gives a full representation of our model. Our model contains three parts: <em>mechanistic model</em>, <em>clinical model</em> and an <em>imputation model</em> derived from the previous two models. The mechanistic model and clinical model stem from the iBAG model introduced in Section 2.1.2. Here, we will focus on two novel parts added to the original iBAG model: the sparsity-induced spike-and-slab priors (<a>Ishwaran and Rao, 2005</a>) for feature selection in both mechanistic and clinical models, and an imputation model to deal with missing omics data.</p><p>There are a total of eight groups of parameters that need to be estimated: <em>&#x3B3;M</em>, <span>&#x3B3;M&#xAF;&#x2060;</span>, <em>&#x3B3;C</em>, &#x3A9;, <span>&#x3C3;k2</span>&#x2019;s, <span>Gmis,&#x2009;Mmis,&#x2009;&#x3C3;2&#x2060;</span>, <em>&#x3B3;M</em> and <span>&#x3B3;M&#xAF;</span> are our parameters of interests. Investigators may also find &#x3A9;s important if they are interested in further inference on methylation-gene regulation. The corresponding Monte Carlo Markov Chain (MCMC) Gibbs sampler will be further discussed in <span><a href=\"https://oup.silverchair-cdn.com/oup/backfile/Content_public/Journal/bioinformatics/34/22/10.1093_bioinformatics_bty775/1/bty775_supplementary_material.pdf?Expires=1577252044&amp;Signature=lr28uwN4aXsvftX0QtJwWom~~UJnKjpZMkfhxgkTns8oZ21V9MQ3NRI5J10Mxl0aJGdeUgwHKj1-PgniMc5aHG5rL5gQNLEG0qs1Jinpxw5m2X5F2BJtyY~gjERob-ipuoqf4ZPEfohqxuB~BbA0rn15LIMi0tQQ3dD7LcVGKZ7LUx5AQW~fAxMxiuF7HpQJbuGYvcoD65vyEYpMHv9iypPGELAUhDuBIHOpQ1YMWduUcOMvep-tXFTx1NGxkTYNWv6B-Y~2Dy-mVB6rNK-FYe2i~SGtuzOV6eF4U2K5I4HlaD9UXVGMwtWtYN5764sBWXnODw9bKJprAa7lp0vOnQ__&amp;Key-Pair-Id=APKAIE5G5CRDK6RD3PGA\">Supplementary Appendix</a></span> Section 2.</p><p><em>Remarks:</em></p><p>Following <a>Wang <em>et al.</em> (2013)</a>, we assume gene-gene independence and methylation-methylation independence. However, we are aware that this assumption deviates from real data, so we also propose a model with gene-gene and methylation-methylation correlations considered (see <span><a href=\"https://oup.silverchair-cdn.com/oup/backfile/Content_public/Journal/bioinformatics/34/22/10.1093_bioinformatics_bty775/1/bty775_supplementary_material.pdf?Expires=1577252044&amp;Signature=lr28uwN4aXsvftX0QtJwWom~~UJnKjpZMkfhxgkTns8oZ21V9MQ3NRI5J10Mxl0aJGdeUgwHKj1-PgniMc5aHG5rL5gQNLEG0qs1Jinpxw5m2X5F2BJtyY~gjERob-ipuoqf4ZPEfohqxuB~BbA0rn15LIMi0tQQ3dD7LcVGKZ7LUx5AQW~fAxMxiuF7HpQJbuGYvcoD65vyEYpMHv9iypPGELAUhDuBIHOpQ1YMWduUcOMvep-tXFTx1NGxkTYNWv6B-Y~2Dy-mVB6rNK-FYe2i~SGtuzOV6eF4U2K5I4HlaD9UXVGMwtWtYN5764sBWXnODw9bKJprAa7lp0vOnQ__&amp;Key-Pair-Id=APKAIE5G5CRDK6RD3PGA\">Supplementary Appendix</a></span> Section 3). Albeit having the options, we will mainly discuss our model with independence assumptions in this article, for two reasons: first, the computational burden for estimating covariance matrices are high. Second, with moderate correlations in simulated data, considering dependency has limited gain in performance compared with model with independence assumption.</p><p>We assume that the methylations are many-to-one mapped to genes, i.e. only the methylation within the promoter region of the gene is mapped to the gene, and each methylation will only be mapped to one gene. The mapping is also assumed to be known from biology background knowledge in our model. The methylation level is centred around 0 if we are using <em>m</em>-value.</p><p>It is reasonable and necessary to assume that if for all the <em>&#x3C9;j</em> where <em>j</em> are within the promoter region of gene <em>k</em>, we let <span>Ij&#x3C9;=0&#x2060;</span>, then we automatically have <span>IkM=0&#x2060;</span>. That is, <span>IkM&#x2260;0</span> only when at least one methylation is selected.</p><p>Two strategy could be adopted to deal with collinearity issue between methylation sites. First, we proposed a random selection strategy based on pairwise Pearson correlation (see <span><a href=\"https://oup.silverchair-cdn.com/oup/backfile/Content_public/Journal/bioinformatics/34/22/10.1093_bioinformatics_bty775/1/bty775_supplementary_material.pdf?Expires=1577252044&amp;Signature=lr28uwN4aXsvftX0QtJwWom~~UJnKjpZMkfhxgkTns8oZ21V9MQ3NRI5J10Mxl0aJGdeUgwHKj1-PgniMc5aHG5rL5gQNLEG0qs1Jinpxw5m2X5F2BJtyY~gjERob-ipuoqf4ZPEfohqxuB~BbA0rn15LIMi0tQQ3dD7LcVGKZ7LUx5AQW~fAxMxiuF7HpQJbuGYvcoD65vyEYpMHv9iypPGELAUhDuBIHOpQ1YMWduUcOMvep-tXFTx1NGxkTYNWv6B-Y~2Dy-mVB6rNK-FYe2i~SGtuzOV6eF4U2K5I4HlaD9UXVGMwtWtYN5764sBWXnODw9bKJprAa7lp0vOnQ__&amp;Key-Pair-Id=APKAIE5G5CRDK6RD3PGA\">Supplementary Appendix</a></span> Section 4). Second, one may conduct principal component analysis (PCA) on methylation sites, and use the first few PCs explaining large proportion of variation.</p><p></p><p>The full Bayesian hierarchical model in the last section allows fast Gibbs sampler. Full conditional formula for iterative sampling are shown in <span><a href=\"https://oup.silverchair-cdn.com/oup/backfile/Content_public/Journal/bioinformatics/34/22/10.1093_bioinformatics_bty775/1/bty775_supplementary_material.pdf?Expires=1577252044&amp;Signature=lr28uwN4aXsvftX0QtJwWom~~UJnKjpZMkfhxgkTns8oZ21V9MQ3NRI5J10Mxl0aJGdeUgwHKj1-PgniMc5aHG5rL5gQNLEG0qs1Jinpxw5m2X5F2BJtyY~gjERob-ipuoqf4ZPEfohqxuB~BbA0rn15LIMi0tQQ3dD7LcVGKZ7LUx5AQW~fAxMxiuF7HpQJbuGYvcoD65vyEYpMHv9iypPGELAUhDuBIHOpQ1YMWduUcOMvep-tXFTx1NGxkTYNWv6B-Y~2Dy-mVB6rNK-FYe2i~SGtuzOV6eF4U2K5I4HlaD9UXVGMwtWtYN5764sBWXnODw9bKJprAa7lp0vOnQ__&amp;Key-Pair-Id=APKAIE5G5CRDK6RD3PGA\">Supplementary Appendix</a></span> Section 2. The final parameter estimates are calculated by averaging stabilized MCMC iterations (i.e. removing the first <em>Br</em> burn-in period in MCMC iterations). The burn-in period <em>Br</em> is determined using Geweke&#x2019;s convergence diagnostics (<a>Geweke, 1992</a>). Geweke diagnostics aims to test whether the first <span>a%</span> and last <span>b%</span> of the MCMC iterations have equal mean, and thus decide whether the samples are drawn from a stationary distribution. As suggested by Geweke, the first 10% of MCMC total iterations are taken as burn-ins once the MCMC chain pass the diagnosis.</p><p>To evaluate the performance, the basic approach we compare with is the CC analysis. For full Bayesian model with missingness, we will also choose to impute gene expression only (FBM<em>G</em>), methylation only (FBM<em>M</em>) or both (FBM<em>GM</em>) when applicable. In simulation studies, we also perform analysis of the complete data (full) to examine the reduction of accuracy caused by missingness.</p><p>To benchmark performance of outcome prediction, we consider RMSE (<a href=\"#E12\">Equation&#xA0;1</a>). In simulation studies, after parameter estimates are obtained we generate a new testing dataset with large sample size (<em>N&#x2009;</em>=<em>&#x2009;</em>2000) and compute RMSE. In real data analysis, we perform 50-fold cross-validation (CV) on complete cases for RMSE evaluation. In each iteration, <span>NCC=2%</span> of complete-case samples are set aside as test dataset, all remaining data are used to perform CC and FBMs analyses. The parameter estimates are then applied to the test data for outcome prediction. After ten iterations, cross-validated RMSE can be evaluated on all complete-case samples with <span>N=NCC</span> in <a href=\"#E12\">Equation&#xA0;1</a>.</p><p>To evaluate feature selection performance, we order genes by <em>q</em>-value, plot receiver operating characteristic (ROC) curves and calculate area under curve (AUC) in simulations since the underlying true predictive genes are known. For real data, since we do not know the true features, we treat the gene selection result from full data analysis (full) as a surrogate of gold standard and compare gene selection from CC (or FBMs) to the full data analysis by tracing the top number of selected genes on the <em>x</em>-axis (e.g <em>x</em>&#x2009;=&#x2009;100 top selected genes by CC and full) and the overlapped number from CC and full on the <em>y</em>-axis (<a>Fig.&#xA0;4b</a>). Comparing the curves of CC and FBMs, a higher curve closer to the diagonal line shows more similar gene selection to &#x2018;full&#x2019; and thus an indication of better performance.</p><p>To evaluate performance of our full Bayesian model with missingness, we perform simulation based on data structure described in Section 2. Specifically, the clinical and methylation data matrices are simulated from <em>N</em>(0, 10) and <em>N</em>(0, 1) with <span>N=(50,&#xA0;100,&#xA0;200,&#xA0;500)&#x2060;</span>, <em>L&#x2009;</em>=<em>&#x2009;</em>2 and <em>J&#x2009;</em>=<em>&#x2009;</em>2000. Each methylation site is randomly assigned to a gene, with the constraint that each gene contains at least one methylation site. In the mechanistic model, <span>Ij&#x3C9;=1,&#x2009;&#x3C9;jk=5</span> and <span>&#x3C3;k2=4</span> for <span>1&#x2264;j&#x2264;J</span> and <span>1&#x2264;k&#x2264;K&#x2060;</span>, where the total number of genes <em>K&#x2009;</em>=<em>&#x2009;</em>1000. We then simulate gene expression matrices from <span>N(M&#x3A9;,diag(&#x3C3;12,&#x2026;&#x3C3;K2))&#x2060;</span>. In the clinical model, 10 genes are randomly selected to impact clinical outcome through methylation and 10 randomly impact not through methylation (i.e. The <em>IM</em> vector has 10 out of <em>K</em> genes equal one and the remaining are zero, and similarly for <span>IM&#xAF;&#x2060;</span>. The selected genes in <em>IM</em> and <span>IM&#xAF;</span> can possibly overlap). For selected genes in <em>IM</em> and <span>IM&#xAF;&#x2060;</span>, the corresponding <span>&#x3B3;kM</span> and <span>&#x3B3;kM&#xAF;</span> are set to 10. The coefficients for clinical data <span>&#x3B3;lC</span> (<span>&#x2060;1&#x2264;l&#x2264;L&#x2060;</span>) are also set at 10 and <span>&#x3C3;2=9</span> to simulate clinical outcome <em>Y</em>.</p><p>After full multi-omics datasets are simulated, data with missingness are generated with <span>&#x3B1;%</span> of samples with missing gene expression data and another non-overlapping <span>&#x3B2;%</span> of samples with missing methylation data. We simulate three scenarios of missingness: (I) Missing only gene expression data with (<em>&#x3B1;</em>, <em>&#x3B2;</em>)=(0.1, 0), (0.2, 0) and (0.5, 0); (II) Missing only methylation data with (<em>&#x3B1;</em>, <em>&#x3B2;</em>)=(0, 0.1), (0, 0.2), (0, 0.5); (III) Non-overlapping samples missing either gene expression or methylation data with (<em>&#x3B1;</em>, <em>&#x3B2;</em>)=(0.1, 0.1), (0.2, 0.2), (0.3, 0.3). For Scenario I, we evaluate CC and FBM<em>G</em> approaches and compare with full. Similarly for Scenario II, we compare CC, FBM<em>M</em> and full. Finally for Scenario III, we compare CC, FBM<em>G</em>, FBM<em>M</em>, FBM<em>GM</em> and full. In this case, FBM<em>G</em> imputes gene expression but ignores samples with missing methylation and similarly, FBM<em>M</em> imputes methylation but ignores samples with missing gene expression. FBM<em>GM</em> utilizes all samples and imputes both gene expression and methylation.</p><p><a>Figure&#xA0;2</a> shows the outcome prediction performance by RMSE for all three scenarios. We first focus on small sample size situations <span>N=50&#x2212;200&#x2060;</span>. In Scenario I, CC, FBM<em>G</em> and full have similar performance when <span>&#x3B1;=10%</span> missing but FBM<em>G</em> clearly outperforms CC when missingness increases to 20% and 50%, showing the benefit of imputation as expected. In contrast, FBM<em>M</em> performs much worse than CC in Scenario II with <span>&#x3B2;=10%</span> methylation missingness and FBM<em>M</em> only slightly outperform CC when missingness increases to 50%. Results of Scenario III are consistent with results of Scenarios I and II. FBM<em>M</em> and FBM<em>GM</em> perform worse than CC at <span>&#x3B1;=&#x3B2;=10%&#x2060;</span>. FBM<em>M</em>, FBM<em>G</em> and FBM<em>GM</em> outperform CC at <span>&#x3B1;=&#x3B2;=50%&#x2060;</span>. It is worth noting that when sample size increases to <em>N&#x2009;</em>=<em>&#x2009;</em>500, the data information is strong enough such that CC has performance similar to full. Imputation almost always create more data uncertainty and have worse performance than CC, especially since the majority of the imputed data are irrelevant to the clinical outcome. </p><p>We next examine feature selection performance by AUC values in <a>Table&#xA0;1</a> (ROC curves shown in <a>Figure 3</a> and <span><a href=\"https://oup.silverchair-cdn.com/oup/backfile/Content_public/Journal/bioinformatics/34/22/10.1093_bioinformatics_bty775/1/bty775_supplementary_material.pdf?Expires=1577252044&amp;Signature=lr28uwN4aXsvftX0QtJwWom~~UJnKjpZMkfhxgkTns8oZ21V9MQ3NRI5J10Mxl0aJGdeUgwHKj1-PgniMc5aHG5rL5gQNLEG0qs1Jinpxw5m2X5F2BJtyY~gjERob-ipuoqf4ZPEfohqxuB~BbA0rn15LIMi0tQQ3dD7LcVGKZ7LUx5AQW~fAxMxiuF7HpQJbuGYvcoD65vyEYpMHv9iypPGELAUhDuBIHOpQ1YMWduUcOMvep-tXFTx1NGxkTYNWv6B-Y~2Dy-mVB6rNK-FYe2i~SGtuzOV6eF4U2K5I4HlaD9UXVGMwtWtYN5764sBWXnODw9bKJprAa7lp0vOnQ__&amp;Key-Pair-Id=APKAIE5G5CRDK6RD3PGA\">Supplementary Figure S1a&#x2013;c</a></span>). In Scenario I, FBM<em>G</em> always has higher AUC values than CC especially when missingness <em>&#x3B1;</em> increases to 25% or 30%. On the contrary, FBM<em>M</em> has lower AUC than CC except for <em>N&#x2009;</em>=<em>&#x2009;</em>50, 100 in <span>&#x3B2;=50%&#x2060;</span>. The message becomes mixed in Scenario III as expected. <div><div><div><p>Table 1.</p><div><p>AUC of different methods in simulation studies</p></div> </div><div>&#xA0;&#xA0;&#xA0;Scenario I&#xA0;Scenario II&#xA0;Scenario III&#xA0;Missing&#xA0;<em>N</em>&#xA0;Full&#xA0;CC&#xA0;FBM<em>G</em>&#xA0;CC&#xA0;FBM<em>M</em>&#xA0;CC&#xA0;FBM<em>G</em>&#xA0;FBM<em>GM</em>&#xA0;FBM<em>M</em>&#xA0;Low<a>a</a>&#xA0;50&#xA0;0.676&#xA0;0.649&#xA0;0.672&#xA0;0.631&#xA0;0.613&#xA0;0.616&#xA0;0.628&#xA0;0.652&#xA0;0.583&#xA0;&#xA0;100&#xA0;0.899&#xA0;0.867&#xA0;0.878&#xA0;0.883&#xA0;0.777&#xA0;0.826&#xA0;0.753&#xA0;0.826&#xA0;0.703&#xA0;&#xA0;200&#xA0;0.967&#xA0;0.976&#xA0;0.983&#xA0;0.961&#xA0;0.863&#xA0;0.946&#xA0;0.859&#xA0;0.913&#xA0;0.789&#xA0;Med<a>a</a>&#xA0;50&#xA0;0.676&#xA0;0.619&#xA0;0.665&#xA0;0.626&#xA0;0.597&#xA0;0.574&#xA0;0.61&#xA0;0.646&#xA0;0.528&#xA0;&#xA0;100&#xA0;0.899&#xA0;0.813&#xA0;0.862&#xA0;0.807&#xA0;0.774&#xA0;0.762&#xA0;0.745&#xA0;0.826&#xA0;0.699&#xA0;&#xA0;200&#xA0;0.967&#xA0;0.941&#xA0;0.961&#xA0;0.939&#xA0;0.861&#xA0;0.903&#xA0;0.858&#xA0;0.917&#xA0;0.795&#xA0;High<a>a</a>&#xA0;50&#xA0;0.676&#xA0;0.53&#xA0;0.637&#xA0;0.557&#xA0;0.588&#xA0;0.534&#xA0;0.583&#xA0;0.636&#xA0;0.512&#xA0;&#xA0;100&#xA0;0.899&#xA0;0.699&#xA0;0.835&#xA0;0.681&#xA0;0.742&#xA0;0.638&#xA0;0.75&#xA0;0.833&#xA0;0.7&#xA0;&#xA0;200&#xA0;0.967&#xA0;0.892&#xA0;0.964&#xA0;0.88&#xA0;0.814&#xA0;0.828&#xA0;0.782&#xA0;0.883&#xA0;0.765&#xA0;</div><div>&#xA0;&#xA0;&#xA0;Scenario I&#xA0;Scenario II&#xA0;Scenario III&#xA0;Missing&#xA0;<em>N</em>&#xA0;Full&#xA0;CC&#xA0;FBM<em>G</em>&#xA0;CC&#xA0;FBM<em>M</em>&#xA0;CC&#xA0;FBM<em>G</em>&#xA0;FBM<em>GM</em>&#xA0;FBM<em>M</em>&#xA0;Low<a>a</a>&#xA0;50&#xA0;0.676&#xA0;0.649&#xA0;0.672&#xA0;0.631&#xA0;0.613&#xA0;0.616&#xA0;0.628&#xA0;0.652&#xA0;0.583&#xA0;&#xA0;100&#xA0;0.899&#xA0;0.867&#xA0;0.878&#xA0;0.883&#xA0;0.777&#xA0;0.826&#xA0;0.753&#xA0;0.826&#xA0;0.703&#xA0;&#xA0;200&#xA0;0.967&#xA0;0.976&#xA0;0.983&#xA0;0.961&#xA0;0.863&#xA0;0.946&#xA0;0.859&#xA0;0.913&#xA0;0.789&#xA0;Med<a>a</a>&#xA0;50&#xA0;0.676&#xA0;0.619&#xA0;0.665&#xA0;0.626&#xA0;0.597&#xA0;0.574&#xA0;0.61&#xA0;0.646&#xA0;0.528&#xA0;&#xA0;100&#xA0;0.899&#xA0;0.813&#xA0;0.862&#xA0;0.807&#xA0;0.774&#xA0;0.762&#xA0;0.745&#xA0;0.826&#xA0;0.699&#xA0;&#xA0;200&#xA0;0.967&#xA0;0.941&#xA0;0.961&#xA0;0.939&#xA0;0.861&#xA0;0.903&#xA0;0.858&#xA0;0.917&#xA0;0.795&#xA0;High<a>a</a>&#xA0;50&#xA0;0.676&#xA0;0.53&#xA0;0.637&#xA0;0.557&#xA0;0.588&#xA0;0.534&#xA0;0.583&#xA0;0.636&#xA0;0.512&#xA0;&#xA0;100&#xA0;0.899&#xA0;0.699&#xA0;0.835&#xA0;0.681&#xA0;0.742&#xA0;0.638&#xA0;0.75&#xA0;0.833&#xA0;0.7&#xA0;&#xA0;200&#xA0;0.967&#xA0;0.892&#xA0;0.964&#xA0;0.88&#xA0;0.814&#xA0;0.828&#xA0;0.782&#xA0;0.883&#xA0;0.765&#xA0;</div></div></div><div><div><p>Table 1.</p><div><p>AUC of different methods in simulation studies</p></div> </div><div>&#xA0;&#xA0;&#xA0;Scenario I&#xA0;Scenario II&#xA0;Scenario III&#xA0;Missing&#xA0;<em>N</em>&#xA0;Full&#xA0;CC&#xA0;FBM<em>G</em>&#xA0;CC&#xA0;FBM<em>M</em>&#xA0;CC&#xA0;FBM<em>G</em>&#xA0;FBM<em>GM</em>&#xA0;FBM<em>M</em>&#xA0;Low<a>a</a>&#xA0;50&#xA0;0.676&#xA0;0.649&#xA0;0.672&#xA0;0.631&#xA0;0.613&#xA0;0.616&#xA0;0.628&#xA0;0.652&#xA0;0.583&#xA0;&#xA0;100&#xA0;0.899&#xA0;0.867&#xA0;0.878&#xA0;0.883&#xA0;0.777&#xA0;0.826&#xA0;0.753&#xA0;0.826&#xA0;0.703&#xA0;&#xA0;200&#xA0;0.967&#xA0;0.976&#xA0;0.983&#xA0;0.961&#xA0;0.863&#xA0;0.946&#xA0;0.859&#xA0;0.913&#xA0;0.789&#xA0;Med<a>a</a>&#xA0;50&#xA0;0.676&#xA0;0.619&#xA0;0.665&#xA0;0.626&#xA0;0.597&#xA0;0.574&#xA0;0.61&#xA0;0.646&#xA0;0.528&#xA0;&#xA0;100&#xA0;0.899&#xA0;0.813&#xA0;0.862&#xA0;0.807&#xA0;0.774&#xA0;0.762&#xA0;0.745&#xA0;0.826&#xA0;0.699&#xA0;&#xA0;200&#xA0;0.967&#xA0;0.941&#xA0;0.961&#xA0;0.939&#xA0;0.861&#xA0;0.903&#xA0;0.858&#xA0;0.917&#xA0;0.795&#xA0;High<a>a</a>&#xA0;50&#xA0;0.676&#xA0;0.53&#xA0;0.637&#xA0;0.557&#xA0;0.588&#xA0;0.534&#xA0;0.583&#xA0;0.636&#xA0;0.512&#xA0;&#xA0;100&#xA0;0.899&#xA0;0.699&#xA0;0.835&#xA0;0.681&#xA0;0.742&#xA0;0.638&#xA0;0.75&#xA0;0.833&#xA0;0.7&#xA0;&#xA0;200&#xA0;0.967&#xA0;0.892&#xA0;0.964&#xA0;0.88&#xA0;0.814&#xA0;0.828&#xA0;0.782&#xA0;0.883&#xA0;0.765&#xA0;</div><div>&#xA0;&#xA0;&#xA0;Scenario I&#xA0;Scenario II&#xA0;Scenario III&#xA0;Missing&#xA0;<em>N</em>&#xA0;Full&#xA0;CC&#xA0;FBM<em>G</em>&#xA0;CC&#xA0;FBM<em>M</em>&#xA0;CC&#xA0;FBM<em>G</em>&#xA0;FBM<em>GM</em>&#xA0;FBM<em>M</em>&#xA0;Low<a>a</a>&#xA0;50&#xA0;0.676&#xA0;0.649&#xA0;0.672&#xA0;0.631&#xA0;0.613&#xA0;0.616&#xA0;0.628&#xA0;0.652&#xA0;0.583&#xA0;&#xA0;100&#xA0;0.899&#xA0;0.867&#xA0;0.878&#xA0;0.883&#xA0;0.777&#xA0;0.826&#xA0;0.753&#xA0;0.826&#xA0;0.703&#xA0;&#xA0;200&#xA0;0.967&#xA0;0.976&#xA0;0.983&#xA0;0.961&#xA0;0.863&#xA0;0.946&#xA0;0.859&#xA0;0.913&#xA0;0.789&#xA0;Med<a>a</a>&#xA0;50&#xA0;0.676&#xA0;0.619&#xA0;0.665&#xA0;0.626&#xA0;0.597&#xA0;0.574&#xA0;0.61&#xA0;0.646&#xA0;0.528&#xA0;&#xA0;100&#xA0;0.899&#xA0;0.813&#xA0;0.862&#xA0;0.807&#xA0;0.774&#xA0;0.762&#xA0;0.745&#xA0;0.826&#xA0;0.699&#xA0;&#xA0;200&#xA0;0.967&#xA0;0.941&#xA0;0.961&#xA0;0.939&#xA0;0.861&#xA0;0.903&#xA0;0.858&#xA0;0.917&#xA0;0.795&#xA0;High<a>a</a>&#xA0;50&#xA0;0.676&#xA0;0.53&#xA0;0.637&#xA0;0.557&#xA0;0.588&#xA0;0.534&#xA0;0.583&#xA0;0.636&#xA0;0.512&#xA0;&#xA0;100&#xA0;0.899&#xA0;0.699&#xA0;0.835&#xA0;0.681&#xA0;0.742&#xA0;0.638&#xA0;0.75&#xA0;0.833&#xA0;0.7&#xA0;&#xA0;200&#xA0;0.967&#xA0;0.892&#xA0;0.964&#xA0;0.88&#xA0;0.814&#xA0;0.828&#xA0;0.782&#xA0;0.883&#xA0;0.765&#xA0;</div></div></p><p>We noticed that since methylation is the up-regulator of gene expression and indirectly impact the clinical outcome, imputing methylation is generally less effective than imputing gene expression. With increasing missing proportion, the benefit of imputation escalates. But when the missing proportion is small or sample size large, the uncertainty brought by imputation will overshadow the contribution from partially observed data (see <span><a href=\"https://oup.silverchair-cdn.com/oup/backfile/Content_public/Journal/bioinformatics/34/22/10.1093_bioinformatics_bty775/1/bty775_supplementary_material.pdf?Expires=1577252044&amp;Signature=lr28uwN4aXsvftX0QtJwWom~~UJnKjpZMkfhxgkTns8oZ21V9MQ3NRI5J10Mxl0aJGdeUgwHKj1-PgniMc5aHG5rL5gQNLEG0qs1Jinpxw5m2X5F2BJtyY~gjERob-ipuoqf4ZPEfohqxuB~BbA0rn15LIMi0tQQ3dD7LcVGKZ7LUx5AQW~fAxMxiuF7HpQJbuGYvcoD65vyEYpMHv9iypPGELAUhDuBIHOpQ1YMWduUcOMvep-tXFTx1NGxkTYNWv6B-Y~2Dy-mVB6rNK-FYe2i~SGtuzOV6eF4U2K5I4HlaD9UXVGMwtWtYN5764sBWXnODw9bKJprAa7lp0vOnQ__&amp;Key-Pair-Id=APKAIE5G5CRDK6RD3PGA\">Supplementary Appendix</a></span> Section 5).</p><p>From the mechanistic model in <a>Figure&#xA0;1b</a>, gene expression and methylation data are not symmetric. Methylation data can be predictive to gene expression data and further predictive to outcomes. On the other hand, gene expression data are less predictive to methylation to help outcome prediction. As we have shown in simulations, imputations do not always improve prediction performance compared with CC analysis. Whether imputation would improve outcome prediction depends on the types of missingness (missing the upstream methylation data or missing the downstream gene expression data or both), the proportion of missingness and sample size. To guide the decision, we propose a self-learning CV scheme. Specifically, we apply 10-fold CV by leaving 10% of CC samples as the test set (for Scenario III <em>N</em>&#x2009;=&#x2009;500, we apply 50-fold CV). We apply CC, FBM<em>G</em>, FBM<em>M</em> and FBM<em>GM</em> to the remaining training data, calculate parameter estimates and apply to test set. The procedure is repeated across all 10-folds and RMSE can be calculated on all test sets. The method with the smallest RMSE is selected to determine whether and how to impute. We conducted sensitivity analysis for this CV scheme (see <span><a href=\"https://oup.silverchair-cdn.com/oup/backfile/Content_public/Journal/bioinformatics/34/22/10.1093_bioinformatics_bty775/1/bty775_supplementary_material.pdf?Expires=1577252044&amp;Signature=lr28uwN4aXsvftX0QtJwWom~~UJnKjpZMkfhxgkTns8oZ21V9MQ3NRI5J10Mxl0aJGdeUgwHKj1-PgniMc5aHG5rL5gQNLEG0qs1Jinpxw5m2X5F2BJtyY~gjERob-ipuoqf4ZPEfohqxuB~BbA0rn15LIMi0tQQ3dD7LcVGKZ7LUx5AQW~fAxMxiuF7HpQJbuGYvcoD65vyEYpMHv9iypPGELAUhDuBIHOpQ1YMWduUcOMvep-tXFTx1NGxkTYNWv6B-Y~2Dy-mVB6rNK-FYe2i~SGtuzOV6eF4U2K5I4HlaD9UXVGMwtWtYN5764sBWXnODw9bKJprAa7lp0vOnQ__&amp;Key-Pair-Id=APKAIE5G5CRDK6RD3PGA\">Supplementary Appendix</a></span> Section 1.2). We note that to evaluate performance of CV scheme in RMSE evaluation of outcome prediction in the Section 5, nested CV will be used (i.e. An outer loop of CV is used to evaluate RMSE and an inner loop of CV scheme for method selection is performed in each training set of the outer loop).</p><p><a>Figure&#xA0;4</a> shows scatter plot of RMSE performance comparing FBM<em>G</em> and CC in Scenario I (<a>Fig.&#xA0;4a;</a><span>&#x3B1;=50%</span> missing gene expression) and FBM<em>M</em> and CC in Scenario II (<a>Fig.&#xA0;4b;</a><span>&#x3B2;=50%</span> missing methylation) in 50 independent simulations. In Scenario I, <em>FBMG</em> generally has smaller RMSE than CC in small sample sizes (<em>N&#x2009;</em>=<em>&#x2009;</em>50, 100, 200). But for <em>N&#x2009;</em>=<em>&#x2009;</em>500, RMSE of FBM<em>G</em> becomes slightly larger than CC on average. For missing methylation in Scenario II, FBM<em>M</em> performs better than CC at <em>N&#x2009;</em>=<em>&#x2009;</em>50 but gradually becomes worse than CC at <em>N&#x2009;</em>=<em>&#x2009;</em>100, 200 and 500. We applied the CV scheme in each simulation to determine whether imputation should be performed or not. Simulations shown by circles represent correct decisions (i.e. CV scheme decides to impute and the RMSE of imputation is indeed smaller than RMSE of CC or vice versa) and cross represents incorrect decision. The result shows universally high accuracy of CV scheme decision. When the decision is wrong, imputation and CC RMSEs are close to each other (near the diagonal line) and the incorrect decision only minimally impacts the outcome prediction. <a>Figure&#xA0;4c</a> shows box plots of RMSE generated from different approaches (CC, FBM<em>G</em>, FBM<em>M</em>, FBM<em>GM</em>, CV) for Scenario III (<span>&#x2060;&#x3B1;=&#x3B2;=25%&#x2060;</span>). At <em>N&#x2009;</em>=<em>&#x2009;</em>50, FBM<em>G</em> and FBM<em>GM</em> both perform well and CV generates similar small RMSE. When <em>N</em> increases to 500, FBM<em>GM</em> becomes much worse and CC performs slightly better than FBM<em>G</em>. Again, the CV scheme makes mostly correct decision and thus generates small RMSE close to the lowest. In conclusion, the simulation results indicate effectiveness of the CV scheme in determining the best strategy of whether and how to impute when encountering missingness in multi-omics data. </p><p>We apply the proposed full Bayesian model with missingness to 460 children asthma nasal epithelium samples obtained from asthma study at Children&#x2019;s Hospital of Pittsburgh, with complete DNA methylation data from Illumina 450k chips and RNA-Seq gene expression data. All data were preprocessed with standard procedures and bioinformatics tools. We used <em>M</em>-value for methylation level for better model fitting. The RNA-seq gene expression counts were transformed to TPM (transcripts per million), a continuous value also more valid for the model assumptions. We filter out genes with small mean expression level (&lt;130.41) or small standard deviation (&lt;23.83) to obtain <em>K&#x2009;</em>=<em>&#x2009;</em>1000 genes for the analysis. We then select methylation sites matched to these 1000 genes. Since some genes have many corresponding methylation sites, we perform PCA to identify the top eigen-methylation sites as input to the model. We take no more than three PCs per gene or less than three PCs that explain at least 75% variation. This generates <em>J&#x2009;</em>=<em>&#x2009;</em>2619 eigen-methylation features for the analysis. The PCA analysis reduces redundant (highly correlated) information in methylation sites and independence of eigen-methylation features fits the model assumptions well. Similar to simulation, we generate three scenarios of missingness: (I) <span>&#x3B1;=50%&#x2060;</span>, (II) <span>&#x3B2;=50%&#x2060;</span>, (III) <span>&#x3B1;=&#x3B2;=20%&#x2060;</span>. For each scenario, we repeat 50 times.</p><p>Serum Immunoglobulin E (IgE) level is a primary clinical outcome in children asthma studies. We take log-transformed IgE level as our clinical outcome, and age and gender as clinical variables. Together with the gene expression and methylation PCs, we run our model with full data and three scenarios of missingness to compare CC approach and full Bayesian model with missingness (FBM<em>G</em>, FBM<em>M</em> and FBM<em>GM</em>).</p><p><a>Table&#xA0;2</a> shows the RMSE of outcome prediction from complete case analysis and FBMs. When 50% samples have missing gene expression (Scenario I), FBM<em>G</em> had reduced RMSE compared with CC (dropped from 43.34.19 to 36.04). In contrast, FBM<em>M</em> had inflated RMSE compared with CC when 50% of missing methylation (51.59 compared with 39.54 in Scenario II). When gene expression and methylation both missed 20% of samples (i.e. 40% of samples had missing values in Scenario III), FBM<em>G</em> had the smallest RMSE (38.71) compared with FBM<em>GM</em> (46.15), FBM<em>M</em> (54.23) and CC (39.09). Our CV scheme performed the automatic selection of whether and how to impute, and the RMSE was always close to the best (I: 36.61, II: 41.09 and III: 40.02). <a>Figure&#xA0;5a</a> shows scatter plot or box plot of RMSEs of different methods in all three Scenarios. Similar to the simulation result, CV scheme mostly selected the best method and the mistakes were near the diagonal line with little predictive impact. <div><div><div><p>Table 2.</p><div><p>RMSE (S.E.) of different methods</p></div> </div><div>Methods&#xA0;Scenario I&#xA0;Scenario II&#xA0;Scenario III&#xA0;CC&#xA0;43.34 (5.33)&#xA0;39.54 (6.85)&#xA0;39.09 (5.43)&#xA0;FBM<em>G</em>&#xA0;36.04 (4.73)&#xA0;&#xA0;38.71 (5.73)&#xA0;FBM<em>GM</em>&#xA0;&#xA0;&#xA0;46.15 (4.74)&#xA0;FBM<em>M</em>&#xA0;&#xA0;51.59 (6.71)&#xA0;54.23 (4.50)&#xA0;CV&#xA0;36.61 (3.78)&#xA0;41.09 (6.17)&#xA0;40.62 (7.36)&#xA0;</div><div>Methods&#xA0;Scenario I&#xA0;Scenario II&#xA0;Scenario III&#xA0;CC&#xA0;43.34 (5.33)&#xA0;39.54 (6.85)&#xA0;39.09 (5.43)&#xA0;FBM<em>G</em>&#xA0;36.04 (4.73)&#xA0;&#xA0;38.71 (5.73)&#xA0;FBM<em>GM</em>&#xA0;&#xA0;&#xA0;46.15 (4.74)&#xA0;FBM<em>M</em>&#xA0;&#xA0;51.59 (6.71)&#xA0;54.23 (4.50)&#xA0;CV&#xA0;36.61 (3.78)&#xA0;41.09 (6.17)&#xA0;40.62 (7.36)&#xA0;</div></div></div><div><div><p>Table 2.</p><div><p>RMSE (S.E.) of different methods</p></div> </div><div>Methods&#xA0;Scenario I&#xA0;Scenario II&#xA0;Scenario III&#xA0;CC&#xA0;43.34 (5.33)&#xA0;39.54 (6.85)&#xA0;39.09 (5.43)&#xA0;FBM<em>G</em>&#xA0;36.04 (4.73)&#xA0;&#xA0;38.71 (5.73)&#xA0;FBM<em>GM</em>&#xA0;&#xA0;&#xA0;46.15 (4.74)&#xA0;FBM<em>M</em>&#xA0;&#xA0;51.59 (6.71)&#xA0;54.23 (4.50)&#xA0;CV&#xA0;36.61 (3.78)&#xA0;41.09 (6.17)&#xA0;40.62 (7.36)&#xA0;</div><div>Methods&#xA0;Scenario I&#xA0;Scenario II&#xA0;Scenario III&#xA0;CC&#xA0;43.34 (5.33)&#xA0;39.54 (6.85)&#xA0;39.09 (5.43)&#xA0;FBM<em>G</em>&#xA0;36.04 (4.73)&#xA0;&#xA0;38.71 (5.73)&#xA0;FBM<em>GM</em>&#xA0;&#xA0;&#xA0;46.15 (4.74)&#xA0;FBM<em>M</em>&#xA0;&#xA0;51.59 (6.71)&#xA0;54.23 (4.50)&#xA0;CV&#xA0;36.61 (3.78)&#xA0;41.09 (6.17)&#xA0;40.62 (7.36)&#xA0;</div></div></p><p>Unlike in simulation, no underlying truth is available for real data and thus calculation of AUC is not possible. <a>Figure&#xA0;5b</a> treats the predicted outcome from full data as the surrogate of underlying truth and compare feature selection from each method with the surrogate (i.e. <em>x</em>-axis shows the same number of features selected by the designated method and full and <em>y</em>-axis demonstrates the overlap between the two). A curve with higher overlap shows better similarity of feature selection with the surrogate, an indication of better performance. Similar to the RMSE result, FBM<em>G</em> performed better than CC in Scenario I, CC better than FBM<em>M</em> in Scenario II, and FBM<em>G</em> and CC performed better than FBM<em>M</em> and FBM<em>GM</em> in Scenario III. CV scheme performs close to the best. All results from this real application are largely aligned with our observations in simulation studies.</p><p>We next investigate whether feature selection from the imputation methods or method selected by CV scheme represent better functional annotation in a biological sense. We obtained the top 200 genes from feature selection of each method by posterior probability order and then performed pathway enrichment analysis by one-sided Fisher&#x2019;s exact test. We collected 2467 pathways from four pathway databases (KEGG, Reactome, Biocarta and GO) with the restriction of pathway size between 10 and 500. The enrichment <em>p</em>-values were then adjusted for multiple comparisons by Benjamini&#x2013;Hochberg procedure. We found 27 enriched pathways from the full data analysis under FDR&#x2009;=&#x2009;1%. We used these 27 pathways as a surrogate of gold standard to benchmark functional annotation performance of each method. <a>Figure&#xA0;6</a> shows box-plots of the minus log-transformed <em>p</em>-values from pathway enrichment of the 27 pathways in each method. As expected, FBM<em>G</em> had better <em>p</em>-value significance distribution than CC in Scenario I. In Scenario II, CC performed better than FBM<em>M</em>. FBM<em>GM</em> and FBM<em>G</em> outperformed CC in Scenario III. The CV scheme automatically determined whether and how to impute, and it always perform close to the best in each scenario. </p><p>Integrative analysis of multi-level omics data brings unique insights to the modulating relationship between different types of omics data. Feature selection and model prediction are two important goals in multi-omics integration, which empowers discovery of disease-associated biomarkers, survival prediction and risk assessment. Several methods have been developed to fulfil these goals, including iBAG using a two-layer Bayesian hierarchical model to discover both association between genes and clinical outcome, and that between gene and upstream regulators. However, none of these methods are able to handle the potential large proportion of missing data in the data integration. In this article, we propose a full Bayesian model with missingness (FBM) inspired by iBAG model, to jointly perform feature selection, model prediction and missing data incorporation. In addition to the mechanistic model and clinical model originally proposed by iBAG, FBM includes a third layer of missingness model to incorporate samples with missingness. The flexibility of Bayesian hierarchical modelling and Gibbs sampler technique enables us to jointly model association among data and infer parameters in all three layers of models together. The Laplace (double exponential) prior initially used in iBAG could not realize exact feature selection. FBM applied spike-and-slab prior for more effective feature selection and allows Bayesian FDR control. We demonstrated outcome prediction and feature selection performance of FBM using extensive simulations.</p><p>From the extensive simulations, we then further realized that imputation is not always favoured over complete case analysis. For example, in high dimensional genomic data analysis, when missingness exists in upstream regulators (i.e. methylation), uncertainty will be increased to impair final inference. When the missing proportion is relatively small and the sample size is large (i.e. signal is strong), CC analysis also often outperforms FBM. To decide the best handling of data with missingness, we proposed a self-learning cross-validation decision scheme. Previously, we have developed a similar self-training selection scheme to select the best microarray missing value imputation method and its downstream biological impact (<a>Brock <em>et al.</em>, 2008</a>; <a>Oh <em>et al.</em>, 2011</a>). In both simulation and the childhood asthma application, we showed superior performance of the CV scheme in prediction outcome and feature selection.</p><p>While Bayesian hierarchical model allows complex parameter structures, it also comes with a computational cost when using conventional inference approaches such as Metropolis&#x2013;Hastings or its special case, Gibbs sampling. In FBM, fast Gibbs sampling was applicable using conjugate priors and the convergence was generally fast (<em>B</em>&#x2009;=&#x2009;2000). We have optimized the R code using C++ with Rcpp package. The computing takes 90&#x2009;min for a reasonably large dataset with <em>N&#x2009;</em>=<em>&#x2009;</em>500 samples, <em>K&#x2009;</em>=<em>&#x2009;</em>1000 genes, <em>J&#x2009;</em>=<em>&#x2009;</em>2000 methylations and <em>B&#x2009;</em>=<em>&#x2009;</em>2000 MCMC iterations using a regular computer with 1 Intel Xeon CPU (2.40&#x2009;GHz). Since the computation burden grows linearly with sample size, feature size and number of iterations, applying FBM with parallel computing could be a solution to substantially speed up computing and allow routine omics applications. An R package, data and source code to replicate all results in this article are available on GitHub (<a href=\"https://github.com/CHPGenetics/FBM\">https://github.com/CHPGenetics/FBM</a>).</p><p>This work was supported by the National Institutes of Health [RO1 CA190766 to Z.F., T.M., L.Z., and G.C.T.&#x2019;s, RO1 MD011764 and RO1 HL117191 to W.C. and J.C.C.&#x2019;s].</p><p><em>Conflict of Interest</em>: none declared.</p><p>&#xA9; The Author(s) 2018. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com</p></div>",
    "images": [
      {
        "url": "https://oup.silverchair-cdn.com/oup/backfile/Content_public/Journal/bioinformatics/Issue/34/22/1/m_bioinfo_34_22cover.png?Expires=1637300045&Signature=38hZoGH98fcLf4S3NWLm0HiMyp2L7CoOCDD2MESlO7MVfd2b0gwDvwviM8XcJU0uUzGR3UAoVhaz15nRcXX3v9LLZgwu3xncn3XEqXd3pwodwK-Pb3Swe05ftFKgxoimyVrP6Lzsbf1kSkajHKEfAXbypym54--QJCQwBfoM-4WqWo5ONYWzfBNYAzFw4WvrmAruBiwoqp0Nbm5BZCrK612r9iW-9NwZYSTa1fI~hnjYUCRVKv5Af0az0Y0pbPblUukKKiK0n3-j8Zw3vMYLKgKTW6IqETJ7zBGbSvMCPZ0vRCqnZRMPD4xNgF5-fW67PTgXBMMlnS7MGMCzEGDWYg__&Key-Pair-Id=APKAIE5G5CRDK6RD3PGA",
        "safe": "https%3A%2F%2Foup.silverchair-cdn.com%2Foup%2Fbackfile%2FContent_public%2FJournal%2Fbioinformatics%2FIssue%2F34%2F22%2F1%2Fm_bioinfo_34_22cover.png%3FExpires%3D1637300045%26Signature%3D38hZoGH98fcLf4S3NWLm0HiMyp2L7CoOCDD2MESlO7MVfd2b0gwDvwviM8XcJU0uUzGR3UAoVhaz15nRcXX3v9LLZgwu3xncn3XEqXd3pwodwK-Pb3Swe05ftFKgxoimyVrP6Lzsbf1kSkajHKEfAXbypym54--QJCQwBfoM-4WqWo5ONYWzfBNYAzFw4WvrmAruBiwoqp0Nbm5BZCrK612r9iW-9NwZYSTa1fI~hnjYUCRVKv5Af0az0Y0pbPblUukKKiK0n3-j8Zw3vMYLKgKTW6IqETJ7zBGbSvMCPZ0vRCqnZRMPD4xNgF5-fW67PTgXBMMlnS7MGMCzEGDWYg__%26Key-Pair-Id%3DAPKAIE5G5CRDK6RD3PGA",
        "width": 520,
        "height": 674
      }
    ],
    "videos": [],
    "audios": [],
    "type": "rich",
    "duration": 350,
    "html": "<div class=\"card\">\n    <a target=\"_blank\" href=\"https://academic.oup.com/bioinformatics/article/34/22/3801/5089231?searchresult=1\">\n      \n    <img onerror=\"this.style.display='none'\" class=\"card-image\" src=\"https://oup.silverchair-cdn.com/oup/backfile/Content_public/Journal/bioinformatics/Issue/34/22/1/m_bioinfo_34_22cover.png?Expires=1637300045&Signature=38hZoGH98fcLf4S3NWLm0HiMyp2L7CoOCDD2MESlO7MVfd2b0gwDvwviM8XcJU0uUzGR3UAoVhaz15nRcXX3v9LLZgwu3xncn3XEqXd3pwodwK-Pb3Swe05ftFKgxoimyVrP6Lzsbf1kSkajHKEfAXbypym54--QJCQwBfoM-4WqWo5ONYWzfBNYAzFw4WvrmAruBiwoqp0Nbm5BZCrK612r9iW-9NwZYSTa1fI~hnjYUCRVKv5Af0az0Y0pbPblUukKKiK0n3-j8Zw3vMYLKgKTW6IqETJ7zBGbSvMCPZ0vRCqnZRMPD4xNgF5-fW67PTgXBMMlnS7MGMCzEGDWYg__&Key-Pair-Id=APKAIE5G5CRDK6RD3PGA\">\n  \n      \n    <div class=\"card-text\">\n      <h3>Bayesian integrative model for multi-omics data with missingness</h3>\n      <p>AbstractMotivation.  Integrative analysis of multi-omics data from different high-throughput experimental platforms provides valuable insight into regulatory me</p>\n      \n        <p class=\"fav\">\n          <img onerror=\"this.style.display='none'\" class=\"favicon\" src=\"https://oup.silverchair-cdn.com/UI/app/img/v-637087210721125680/favicon-16x16.png\">\n          OUP Academic\n        </p>\n    </div>\n  \n    </a>\n    </div>"
  },
  {
    "url": "https://science.sciencemag.org/content/362/6418/eaav0725",
    "site": "Science",
    "favicon": {
      "url": "https://science.sciencemag.org/sites/default/files/images/favicon.ico",
      "safe": "https%3A%2F%2Fscience.sciencemag.org%2Fsites%2Fdefault%2Ffiles%2Fimages%2Ffavicon.ico"
    },
    "title": "Substrate-engaged 26S proteasome structures reveal mechanisms for ATP-hydrolysisdriven translocation",
    "description": "The proteasome is a cytosolic molecular machine that recognizes and degrades unneeded or damaged proteins that have been tagged with ubiquitin. A heterohexameric adenosine triphosphatase motor pulls the substrate into the proteolytic chamber, while at the same time, a protein located at the entrance of this motor removes the ubiquitin. De la Pea et al. trapped the substrate inside the motor by...",
    "article": "<div><div><p>The proteasome is a cytosolic molecular machine that recognizes and degrades unneeded or damaged proteins that have been tagged with ubiquitin. A heterohexameric adenosine triphosphatase motor pulls the substrate into the proteolytic chamber, while at the same time, a protein located at the entrance of this motor removes the ubiquitin. De la Pe&#xF1;a <em>et al.</em> trapped the substrate inside the motor by inhibiting removal of ubiquitin. This allowed them to determine cryo&#x2013;electron microscopy structures in the presence of substrate and adenosine triphosphate (ATP). The findings distinguish three sequential conformational states that show how ATP binding, hydrolysis, and phosphate release are coordinated between the six subunits of the motor to cause the conformational changes that translocate the substrate through the proteasome.</p><p><em>Science</em>, this issue p. <a href=\"/lookup/doi/10.1126/science.aav0725\">eaav0725</a></p></div><div><div><p>As the major protease in eukaryotic cells and the final component of the ubiquitin-proteasome system, the 26<em>S</em> proteasome is responsible for protein homeostasis and the regulation of numerous vital processes. Misfolded, damaged, or obsolete regulatory proteins are marked for degradation by the attachment of polyubiquitin chains, which bind to ubiquitin receptors of the proteasome. A heterohexameric ring of AAA+ (ATPases associated with diverse cellular activities) subunits then uses conserved pore loops to engage, mechanically unfold, and translocate protein substrates into a proteolytic core for cleavage while the deubiquitinase Rpn11 removes substrate-attached ubiquitin chains.</p></div><div><p>Despite numerous structural and functional studies, the mechanisms by which adenosine triphosphate (ATP) hydrolysis drives the conformational changes responsible for protein degradation remained elusive. Structures of related homohexameric AAA+ motors, in which bound substrates were stabilized with ATP analogs or hydrolysis-eliminating mutations, revealed snapshots of ATPase subunits in different nucleotide states and spiral-staircase arrangements of pore loops around the substrate. These structures gave rise to &#x201C;hand-over-hand&#x201D; translocation models by inferring how individual subunits may progress through various substrate-binding conformations. However, the coordination of ATP-hydrolysis steps and their mechanochemical coupling to propelling substrate were unknown.</p></div><div><p>We present the cryo&#x2013;electron microscopy (cryo-EM) structures of the actively ATP-hydrolyzing, substrate-engaged 26<em>S</em> proteasome with four distinct motor conformations. Stalling substrate translocation at a defined position by inhibiting deubiquitination led to trapped states in which the substrate-attached ubiquitin remains functionally bound to the Rpn11 deubiquitinase, and the scissile isopeptide bond of ubiquitin is aligned with the substrate-translocation trajectory through the AAA+ motor. Our structures suggest a ubiquitin capture mechanism, in which mechanical pulling on the substrate by the AAA+ motor delivers ubiquitin modifications directly into the Rpn11 catalytic groove and accelerates isopeptide cleavage for efficient, cotranslocational deubiquitination.</p><p>These structures also show how the substrate polypeptide traverses from the Rpn11 deubiquitinase, through the AAA+ motor, and into the core peptidase. The proteasomal motor thereby adopts staircase arrangements with five substrate-engaged subunits and one disengaged subunit. Four of the substrate-engaged subunits are ATP bound, whereas the subunit at the bottom of the staircase and the disengaged subunit are bound to adenosine diphosphate (ADP).</p></div><div><p>Of the four distinct motor states we observed, three apparently represent sequential stages of ATP binding, hydrolysis, and substrate translocation and hence reveal the coordination of individual steps in the ATPase cycle and their mechanochemical coupling with translocation. ATP hydrolysis occurs in the fourth substrate-engaged subunit from the top, concomitantly with exchange of ADP for ATP in the disengaged subunit. The subsequent transition, which is likely triggered by phosphate release from the fourth, posthydrolysis subunit of the staircase, then involves major conformational changes of the entire ATPase hexamer. The bottom ADP-bound subunit is displaced and the previously disengaged subunit binds the substrate at the top of the staircase, while the four engaged subunits move downward as a rigid body and translocate substrate toward the peptidase. Our likely consecutive proteasome conformations, together with previously determined substrate-free structures, suggest a sequential progression of ATPase subunits through the ATP-hydrolysis cycle. We hypothesize that, in general, hexameric AAA+ translocases function by this sequential mechanism.</p><figure>\n  \n    \n    <span>Cryo-EM structures of the substrate-engaged 26<em>S</em> proteasome.</span><p>(<strong>A</strong>) Substrate path through the proteasome, with ubiquitin bound to Rpn11 (left inset) and the substrate polypeptide traversing through the AAA+ motor into the core peptidase. (<strong>B</strong>) Schematic showing coordinated ATP hydrolysis and nucleotide exchange observed between consecutive motor states. (<strong>C</strong>) Substrate translocation is driven by changes in the spiral-staircase arrangement of pore loops, as indicated by arrows.</p>  \n  </figure></div></div><div><p>The 26<em>S</em> proteasome is the primary eukaryotic degradation machine and thus is critically involved in numerous cellular processes. The heterohexameric adenosine triphosphatase (ATPase) motor of the proteasome unfolds and translocates targeted protein substrates into the open gate of a proteolytic core while a proteasomal deubiquitinase concomitantly removes substrate-attached ubiquitin chains. However, the mechanisms by which ATP hydrolysis drives the conformational changes responsible for these processes have remained elusive. Here we present the cryo&#x2013;electron microscopy structures of four distinct conformational states of the actively ATP-hydrolyzing, substrate-engaged 26<em>S</em> proteasome. These structures reveal how mechanical substrate translocation accelerates deubiquitination and how ATP-binding, -hydrolysis, and phosphate-release events are coordinated within the AAA+ (ATPases associated with diverse cellular activities) motor to induce conformational changes and propel the substrate through the central pore.</p></div></div>",
    "images": [
      {
        "url": "https://science.sciencemag.org/sites/default/files/highwire/sci/362/6418.cover-source.gif",
        "safe": "https%3A%2F%2Fscience.sciencemag.org%2Fsites%2Fdefault%2Ffiles%2Fhighwire%2Fsci%2F362%2F6418.cover-source.gif",
        "width": 346,
        "height": 440
      },
      {
        "url": "https://science.sciencemag.org/content/sci/362/6418/F1.medium.gif",
        "safe": "https%3A%2F%2Fscience.sciencemag.org%2Fcontent%2Fsci%2F362%2F6418%2FF1.medium.gif",
        "width": 346,
        "height": 440
      }
    ],
    "videos": [],
    "audios": [],
    "type": "rich",
    "duration": 2703,
    "html": "<div class=\"card\">\n    <a target=\"_blank\" href=\"https://science.sciencemag.org/content/362/6418/eaav0725\">\n      \n    <img onerror=\"this.style.display='none'\" class=\"card-image\" src=\"https://science.sciencemag.org/sites/default/files/highwire/sci/362/6418.cover-source.gif\">\n  \n      \n    <div class=\"card-text\">\n      <h3>Substrate-engaged 26S proteasome structures reveal mechanisms for ATP-hydrolysisdriven translocation</h3>\n      <p>The proteasome is a cytosolic molecular machine that recognizes and degrades unneeded or damaged proteins that have been tagged with ubiquitin. A heterohexameric adenosine triphosphatase motor pulls the substrate into the proteolytic chamber, while at the same time, a protein located at the entrance of this motor removes the ubiquitin. De la Pea et al. trapped the substrate inside the motor by...</p>\n      \n        <p class=\"fav\">\n          <img onerror=\"this.style.display='none'\" class=\"favicon\" src=\"https://science.sciencemag.org/sites/default/files/images/favicon.ico\">\n          Science\n        </p>\n    </div>\n  \n    </a>\n    </div>"
  }
]